[{"name": "Movie Master", "desc": "\nDescriptionWhen you want to go out for a movie but don’t know which one to choose, or you want to watch a certain movie but don’t know if you will like it, you can use our website to search movies by name, year and type to get the information you want and see the comments from real users. Also, when you have seen a movie and want to say something about it, you can upload some comments about it. Our website is a user-friendly platform to help users find useful information about movies and share feelings with others. Moreover, on our website, users can chat with people that are interested in the same movie in our chatroom. It will always be fun to talk to people who have same interests! You can also see all the movie theaters near you on our website to choose which one to go to. Just enjoy!Usefulness For people who like movies, it’s convenient to search information on our website. The goal of our website is to build a platform to provide useful information and a chance to share comments on movies.Description of the functionality that you plan to offerBasic functions:User login. Upload comments on movies.Delete one's own comments.Search for information of a specific movies, or search for all movies in a particular year, or just search movies of an interesting type.Use 'contribute' parameter to represent the contribution of each user, the main goal of this design is to encourage users to post comments.Advanced functions:Want to talk with people who share same interest? Use our Chat Room!When a user is searching and reading comments of a particular movie, he or she can talk with other people who are viewing this movie in real time! Also, users can read the chat logs, which is about previous comments on this movie.Planning to watch movies? Find nearby cinema!Users may feel like watching a movie after reading great comments about it. Base on this phenomenon, we implement this function to show cinemas near a user's location. We get the latitude and longitude of a user and show nearby cinema for him.\n", "members": ["Caiwei He (caiweih2)", "Yujuan zhang(yujuanz2)", "Jiefei Shi(jiefeis2)"], "skills": ["java"]}, {"name": "Vivacity", "desc": "\nDescriptionOur project aims to give music recommendations to a user based on the user's location, their current mood, and the current weather in that location.Usefulness. A similar application is Spotify's 'Climatune' application, which provides listening history based on the weather. However, the location the information is pulled from is random, and is not tuned to the user's own weather conditions. Also, it is not realtime, and the weather to give recommendations for must be chosen.RealnessOur data will be taken from AccuWeather or a similar weather API service. The music data may come from user's own libraries or from an online source. In the end we hope to use some kind of heuristic to judge what songs are appropriate for what atmospheres.Description of the functionalityOne of our advanced features will be the realtime updating of music suggestions based on changes in the weather as they happen. We think this is a unique feature since most playlists are focused on fixed sets of songs based around a theme, while our recommendation system intends to evolve as time passes.The second advanced feature will be our algorithm to determine the appropriateness of songs for certain atmospheres. This algorithm must also take into account the user's judgement of appropriateness of the suggested music.Basic Functions1. User can request a playlist depending on a mood or weather type. Songs will be pulled from existing music services such as Spotify.2. User can also edit their mood playlists by adding or deleting songs.3. User can also instead of putting in weather simply put in their location and we will pull weather data and generate a matching playlist for the weather at their location.4. User account functionality so that users can save their preferences and playlists.   \n", "members": ["Elliott Rodriguezedrodri2", "Tarandeep Saggu", "Ian Pickering ipicker2"], "skills": []}, {"name": "eBase XCHG", "desc": "\nDescription of the application domain of your choice. We plan to offer a university-student based goods exchange system. This is particularly targeted at students going to graduate soon and incoming freshmen and transfer students, but is also useful for regular sales and exchanges throughout the semester too.Usefulness. A lot of students will have things they no longer want or need when they graduate. Currently, most of these students will throw these items away due to the difficulty of finding someone who would be interested in buying, while incoming students have to buy new items as it is difficult to find people selling items that they need. This creates a lot of unnecessary waste and redundant buying. With our project, we will connect sellers and buyers so both can achieve their goals. Currently, the most similar website is Craigslist. However, Craiglist is open to the general public, has no credibility, and is heavily filled with spam posts. Our website will require a .edu email or ID verification and thus is open only to the university community. And when compared against leading e-commerce and Consumer to Consumer (C2C) sites like eBay.com, our system would offer little to no service fee (compared to 13% through eBay). After deployed at various universities and gaining sufficient users we can even allow advanced trading functions like exchange across campuses/universities too.Exchange is open for services too, allowing students to put skills and service in the database: electronics repair, long distance car share (e.g. UIUC to Chicago, Purdue, IUB, etc.)Realness.  Our data is going to be mostly generated by users, people can post items they want to sell or post about items they want to buy. Data will include account info, sale posts, etc.Description of the functionality that you plan to offer.  This is where you talk about how to meet the functionality requirements.  There are two types of functions you need to offer:Basic Functions: 1.) Real data will come from user inputs like account info and user posts.2.) New users will create accounts with .edu email, generating an account in the database (username, password, account profile data). After email verification the new account will have ability to modify account profile (update/delete), post item for sale (insert), manage posts, and make offer/purchase/comment on other posts (insert/update).3.) User can search by item name/keyword, by category, and by post time. Results will be printed/displayed by date, popularity (offers & comments), and by relevance.Advanced Functions:1.) Best offer/price negotiation function with UI built in to site, allow users to send offers to buyer, and allow buyer to set a automatic threshold and accept an offer above certain price point.2.) Extract item information from user posts and crawl real time price online through e-Commerce sites like Amazon.com, BestBuy.com, Walmart.com, etc. for pricing and item specs, and display them in posting page. This reference information makes it easier for buyers when browsing through the posts. It also makes it easier for seller to set price for item.3.) Possible real time bidding function for users. Limited time bidding allows more flexibility for both buyer and sellers.\n", "members": ["Shuodong Zhang szhang84", "Xinyi Wu", "xinyiwu2", "Wenjie Zhu wzhu26", "Mickey Zhang rzhang56"], "skills": ["java", "php"]}, {"name": "Foodzilla", "desc": "\nDescription of an application of your choice. State as clearly as possible what you want to do. What problem do you solve and etc? Our app will give recommendations based on people's criteria: from price range to type of food, and also based on if they want to go to the restaurants they have been to or not. Another feature that we're gonna implement is generating random restaurants. This app is going to be useful for those people who just can't decide where to eat. Usefulness.  State as clearly as possible why your chosen application is useful.  Make sure to answer the following questions: Are there any similar or equivalent web sites/applications out here?  If so, what are they and how is yours different? A similar site/application is Yelp. Our application is different with Yelp because we allow users to create a list of the restaurants they have been to and let them choose which restaurant they want to go. Another feature that we're gonna implement is generating random restaurants.Realness.  Describe what your data is and where you will get it. Our data will be restaurants and user location. We're not gonna scrap data from Yelp or Google, but we're gonna get it from restaurant databases, e.g. Factual.Description of the functionality that you plan to offer. This is where you talk about how to meet the advanced functionality requirements.  There are two types of functions you need to offer: Basic Functions: see Stage 5 for what kind of basic functions you need to offer:        i. We will have a search function that could generate all nearby restaurants based on the user's selected filter.       ii. We will also have a function that could add our own favorite restaurant and then generate the user history.Advanced Functions: We will keep track of previously accessed restaurants and have users rate their experiences at those restaurants. Using that data we will adjust our suggestion algorithm based on certain criteria (The rating they gave, the specific tags that the restaurant has such as Chinese or Mexican food etc). Using this we will be able to suggest new restaurants that are based on their previous tastes and preferencesIn addition, we will allow users to log in and create an account storing their previous accessed restaurants. Furthermore, they will be able to access their own and other friend's accounts to accommodate for and adjust to other people's tastes. This would be useful for situations where you have a group of people and are unsure of what restaurant would best accommodate everyone's tastes. Create a page with the title \"ER Design\" on your project page and link it under Documents. In \"ER Design\", you should have the ER diagram for your application, plus descriptions in plain words on the assumptions you make. For example, \"we think that there must be only 1 adviser for each student\".For our ER Design diagram, we have concluded that we would need four main entity sets (e.g. Restaurants, Food, Customer, and History) and each of them hold its own unique attributes. Restaurants have attributes that consist of Name, Address, Phone Number, and Type. We believe that Name and Address are the two keys that could identify a uniquely identifiable entities which is Restaurants. Food have attributes that consist of Price, Name, Type, and Rating. We believe that the attribute Name is the key that could identify the entity Food. We also think that Food has a relationship of at most one to Restaurant. Meanwhile, Customer have the attributes of Email, Username, Password, Condition and Email and Username as the keys of the entity set. We think that Restaurant and Customer has the relationship of many to many since multiple customers could have the same relation to the Restaurants and vice versa. The last entity sets, History, consist of (Time and Date) and Restaurant Name.  We think that History has the relation of at most one with Customers.  \n", "members": ["Lina Sie linasie2", "Drew Pilgrim pilgrim2", "Enkh-Ider Jargalsaikhan jargals2", "Aldo Sanjoto sanjoto2"], "skills": ["java"]}, {"name": "Same Campus", "desc": "\na.Description Our project is to build an online platform for second-hand goods trading, house subleasing ,ride services and courses tutoring. Currently, our target users are university students. Every user needs to register by their school emails. Through our platform, users could post tasks or take tasks from others. Once you accomplish posted tasks, you will receive corresponding money reward. Similarly if your tasks are solved by other users, you need to pay a certain amount of money. Primarily we focus on following types of tasks. Ride services for students who don’t have their own cars but need rides (preferred long-distance). Tutoring services for students seeking tutors about specific courses. Proofreading for academic writing or application essay review. Second-hand goods and house subleasing trading. Via our website, each user could access resources beyond their social networks.b.UsefulnessWe think our application is useful since we realize that at most of time, people are confined by their social networks while encountering some problems. Our application provides a platform for users to break the restrictions from their own social networks and receive helps from outsides. Most prevailed social network applications don’t have any confine on their user selection. Everyone could have an account or even some of them have multiple accounts. This situations enormously decrease user’s credit standing. The difference between our program and others is that we specifically target on university students. Only school emails would be legit to sign up on our website. By this means, we could filter frauds and vicious users at large extent. Besides, we categorize the types of tasks posted on our website in order to accelerate the efficiency.c.RealnessRealness: Our data contains the personal information (username, password, email-address, sns account) of users, the information of tasks (title, type, post time, solved, user), etc that people post online. So in general the data will be primarily based on the input of our users.d.DescriptionBasic functions:Our data comes from real user inputs such as the user information and task information.When user posts a task or creates an account, we will add a tuple in the corresponding table (insert). When user edits the task or edit his/her user information, we will update the tuple in the table (update). When user deletes his/her post, the corresponding tuple will be deleted. Users can search by category or simply search the key word.Advanced functions:      1. Spam detector to filter out inappropriate tasks by some \"spam words\" with classifiers like Naive Bayes.      2. For second hand trading, we will show similar items to users using machine learning algorithms such as clustering.       3. Notify user through email if something they were looking for is on the task board according to the searching history of the user.   \n", "members": ["Ningkai Wu nwu10", "Ziyang Liu zliu63", "Yanda Hu yandahu2", "Naijing Zhang nzhang31"], "skills": ["python", "java", "php"]}, {"name": "Open Classroom", "desc": "\nDescriptionOpen Classroom will be a web application that aims to encourage students to ask questions and communicate with their professor and classmates anonymously. If a student is feeling apprehensive about raising their hand and asking questions in a large class, Open Classroom will take that apprehension away. This application will provide a platform for students to ask and vote on questions for their professor to receive during a lecture or review session. It will give professors the ability to poll students on questions, and provide data and feedback from past questions or years. UsefulnessThis application is useful because it provides an integration of the functionality of i-clicker or similar devices, as well as class forums such as piazza, but for live questioning. Our idea is different than other applications which share some functionality, because it works to provide interaction between the class and the lecturer in multiple ways, as well as making use of past data or questions to improve the class experience.RealnessThe data will be created by each class session that uses the application. The data is the questions, and the polling results. It is stored and manipulated to give the students and professor a better learning/teaching experience, and enables participation by more students.FunctionalityBasic FunctionsLogin through university account (For both student and Professor)Provide anonymity to students (among students), but not from professor. This allows the students to be more open to asking questions in class.Rating system for questions, so the best rated question can be answered by the professor. This functionality is built so that the professor doesn't get over whelmed by the amount of questions that they get in the class. They may change the \"question show-up\" threshold to be 3, and then only questions that get 3 other up votes will show up on the professors screen. This will also give an impetus to students to ask good questions, and for other students to up vote a question rather than asking the same questions again so the professor can get to see it on their screen.Store data by each class session. All questions for the class session are later accessible by search.Advanced FunctionsRetrieve past class sessions data from a filterable search engine. This will be made possible from having the basic functionality number 4.We will query all data that we have from previous runs of the class to see if it was asked in the previous semesters. This will save time for the professor and the student. In addition (If time permits), we intend to pull questions from previous class runs on piazza as well, to increase the amount of data we can query.Stats for in class questions. This will show things like who asked what questions. This functionality will allow the professor to see the effectiveness of questions, the rate at which various students ask questions, and how reaction/response of other students to the questions. The student response to other students questions allows the professor to gauge student understanding of the subject as well (more people up-vote a question == more people confused about the topic explained by the professor).\n", "members": ["Abdullah Motan amotan2", "Seth Primack sprimac2", "Shimul Chaudhary chadhry4", "Jose Morales Valenzuela jmoral39"], "skills": ["java", "php"]}, {"name": "BookGenie", "desc": "\nDescription: We intend to create an online textbook service where students at our university can type in their class codes and find out the textbook they need for that class. Offers from other websites (UIbookstore, Amazon, eBay, Chegg and Facebook) will also be available so users can compare prices and find their best option. We will provide the URL for each offer so they can go to the website they are interested in and make purchases. Moreover, users can also put in information of the books they want to sell and make offers at our service. Prices from different dealers will also be available to help them decide how much they shall set the price.This service solves the problem students have when looking for cheaper options of textbooks. Since there is few website that has integrated resources, students always have to go to various websites and make a lot of searches to find the book they want, while worrying about whether they get the right book or edition. In order to solve this problem, our service will link the book information from the bookstore website to other dealers, and show all corresponding information in one search. Usefulness: This will be a very useful service because it solves the problem mentioned above and makes the book searching experience much easier for students. Besides, since it integrates offers from both other websites and individual sellers on Facebook, it also maximizes the chance students find an optimal deal, which will make it welcome in the user group.There is almost no similar service around based on our research. UIbookstore website offers the “compare price” function, however, there is always no result or very limited information shown for textbook searches. All other websites only provide book and price information without corresponding classes or universities related to it. So our service will be unique by combining class and textbook, and offer information. Realness: We will get our data from different book websites. On one side, we will crawl data from UI bookstore website, where we can get class and corresponding textbook information. On the other side, we will crawl data from Amazon, eBay and Chegg for related books, prices and URLs. We will also get data from Facebook textbook and exchange group (if possible) to get individual offers and their contact information. Functionality: Basic functions:(1) We will crawl data from the four sites to build a database as mentioned above.(2) Moreover, we will also allow users to enter their own data when they create accounts. The accounts will be updated with their book research and purchase history.Advanced:(1) Parsing data from the four websites to our system automatically.This will be very useful to our service because the offers at other websites or of individual sellers are constantly changing, and we want our user to have the most updated information. Also, the availability of individual offers are updating fast, so it is important for us to give them the correct information(2) Giving time recommendations and price forecasts based on the price trend in historical data.This will be cool because through the analysis of historical data, we can give users recommendations of when is the best time to make purchases and help them save money. If prices always go down after a week school starts, it will be helpful to let the users know so that they can have a better deal. \n", "members": ["David Levering (leverin2)", "Pooja Welling (pgwelli2)", "Irina Zhang", "yzhan198)"], "skills": ["java", "php"]}, {"name": "EvCoor (Event Coordinator)", "desc": "\nDescription of application:- Our application will be a website for people to organize group-based events. Users will be able to create and modify events, set up groups, create projects, designate tasks, and network with other members of specified roles in order to participate. Usefulness:- It will be useful to streamline and simplify the process of searching for and gathering groups of similar skills. This will primarily be useful for Undergraduate and Graduate students who are looking to join, form, or manage teams for classes or events that they want to participate in, such as hackathons or engineering design competitions. Project management applications like Trello and Asana can help you manage a team and organize your project but are only useful once you actually have a team in place. This application will help you find the ideal team and then give you the tools to manage it.Realness:- The data will be almost all user-inputted. Users will register and be able to create and set up groups, and organize events if they have permission/clearance to do so. There will be some auxiliary data created and used by the advanced function as well, which will also probably be stored in the database.Basic Functions:- Keeps track of users and their various statistics – skills, past projects/teams, past events, friends/associates, experience level, overall rating- Users can create and maintain events, as well as specify various requirements about participation.- These events can have various effects on participating groups and users. For example, earning a notable mention from one of these events might leave a record on the group and their users. This may be listed under achievements by a user and can improve their overall rating.- Users can create groups to target these various events, and after that, users can add, modify, and remove others from their groups. Users will also be able to assign tasks to their team members and designate specific roles for team members.- The main part of the application ties into this: Users will be able to streamline this group formation process and make it easier to create well-balanced and compatible teams. For example, if a group needs a UI designer, the user will be able to search for all UI-designer-tagged users in the database. Advanced Features:Advanced Feature 1: Intelligent analysis based on gathered user and event statistics.- As users and their formed groups participate in more and more events and gather recognition, the application will be able to assign various statistics to those users in order to form and identify trends. Using those statistics, the application should be able to analyze the user's capabilities and compatibility in order to recommend the user into certain events, certain groups, or perhaps even to restrict a user out of certain events.- Example 1: A user has been consistently rated low by a particular group of people after working within their group. The system should recognize this and dissuade the user from joining similar groups in the future.- Example 2: A user creates an event. He will be able to specify a certain skill bracket and restrict higher-skilled users from participating in such events, in order to create a more standardized and fair competition. Advanced Feature 2: Various intricate visualizations of a user's statistics, so that the user can intuitively understand his own capabilities. It will be implemented in pure HTML5/JavaScript.- As we're gathering more and more information about a user, we would have a page where a user can see his own (or maybe others, with permission) data organized and laid out in a pleasing, easy-to-understand manner. By doing this, the application may even reveal certain traits or skills that the user would have previously been unaware of about himself.\n", "members": ["Arun Abraham (atabrah2)", "Jun Choi (jchoi207)", "Karan Arora (krarora2)", "Ryan Wolfe (rpwolfe2)"], "skills": ["java", "php"]}, {"name": "REFERENCES", "desc": "\nProject TitleREFERENCESProject descriptionREFERENCES is a website for users to manage and find good papers to cite. Except basic query can be achieved on this website, this website can give the recommendation based on the user personalization. Unlike the Google Scholar \"pull mode\" website, the REFERENCES is more likely a \"push mode\" website.UsefulnessTo help users finding high-quality papers in their research areas. Easy for users managing their downloaded and published papers. There are several website similar to ours such as Google Scholar, but our advantage compare to them is simplicity. We don't have detail content from the paper, but just basic information, which is easier for users to go over and find the paper that they are looking for instead of reading a bunch of useless paragraphs that doesn't related to what they want. We also rank the paper by its quality unlike Google Scholar, the detail is in the description of advanced functionality.RealnessThe data we have used in our database are from DBLP and https://aminer.org/, which we wrote a program in python that can capture all the basic information appears in these two website, such as user, venue, date, etc.Functionality (basic)Insert user or favorite paper:Insert data in the registration pageAdd paper that user select to his favorite paper listSearch Paper:Search by JournalSearch by ConferenceSearch by AuthorSearch by YearUpdate:After a user adding a paper to his list, a heart symbol will appear instead of “+” symbol, and the number next to “Cart” will update to the new number of papers that currently in user’s list. When user go to his list, he will see the paper he just added is already in the list. User can delete the paper from his list and that paper will not appear in his list.Delete:User can delete the paper from his list and that paper will not appear in his list.Functionality (advanced)1 RANKING BASED RECOMMENDATION SYSTEMThe recommendation system we plan to provided with the following feature:Get recommendation of the papers that liked by the users who also like the papers added by you.Question: Get the title of papers that liked by the users like the paper you added (e.g. your userID = ''12345\").SELETC paperIDFROM FavoriteWHERE userID IN(SELECT f2.userIDFROM Favorite f1, Favorite f2WHERE f1.userID = '12345' AND f1.userID = f2.userID);Get ranking of authors based on the number of publications. Since the DBLP data (we crawled which used in this project) doesn't have citation information, here we cannot conduct a PageRank algorithm, instead we do a basic ranking which is to rank the authors based on the number of publication.Calculate the overall ranking of each papers based on its authors score then print them in the ranked order.After we got the authors and their corresponding ranking score, we will calculate the ranking of each paper based on its author ranking. Then print the recommend papers in a ranked order.2 SIMILARITY MEASURE SYSTEMAdvanced recommendation - get similar authorsAbove recommendation just based on query in the database. But didn't involve any algorithm. Here we introduce a similarity measure called PathSim to discovery the similarity by the meta path we select. Algorithm implementation:step 1: select meta path, we plan to use A-P-V-P-A, where (A is author, P is paper, V is venue). step 2: form author author adjacency matrix based on the meta path we selectedstep 3: implement the algorithm: step 4: form a static data base of top5 most similar authors of each author, also we will set up a threshold to remove unpopular author (means rare publications).More details can be found in:Sun, Y., Han, J., Yan, X., Yu, P. S., & Wu, T. (2011). Pathsim: Meta path-based top-k similarity search in heterogeneous information networks. Proceedings of the VLDB Endowment, 4(11), 992-1003.\n", "members": ["Jing Ma", "Jialin Yang"], "skills": ["php"]}, {"name": "Smart Movie (e.g., Movie Information and suggestion Database)", "desc": "\nDescriptionOur website stores movies' information by crawling from various movie rating website. We will let user search, make reviews on and like movies. Sometimes, viewers cannot find new movies that they like. Our website solve this problem by letting users like movies ,and suggestions will be  generated based on users' likes.UsefulnessWe want to make a movie website which can not only let you rate and search, but also gives you accurate suggestion based on the movies that you liked by implement machine learning. IMDB is a similar website while it doesn't give suggestion or notification.RealnessOur entity sets are movie, actor, director, user and review.Movie have name, year, rating and have multiple subclasses like romance and action. For movie information, we will crawl current movie websites like IMDB and rotten tomato. User data will be input by users. Review will be made by users and append to movies. Director and actor data will be crawled from movie websites like IMDB and linked to Wikipedia.Description of the functionality that you plan to offerBasic Functions: (1) Crawling data from other website  (2) User can make review and we will Insert/delete/update (3) Given the search constraints, conduct basic query that searches the database and list or print the returned records. Advanced Functions:(1) Based on users' preference history, it give smart suggestion of similar movies using machine learning algorithm.(2) Web crawling different websites and integrate data by connecting duplicate records. (3) Based on users' preference, find similar future released movies and send email notification before the premiere. \n", "members": ["Jianlin Du jdu12", "Rongzi Wang rwang67", "Guoxin Huang ghuang14", "Ruoxi Yang ryang28"], "skills": ["python", "java"]}, {"name": "Crossroads", "desc": "\nDescriptionCrossroads is a website where open source project maintainers/owners can list their projects to help find contributors. We want to make it easier for developers to find projects that they can join and help grow the open source community by increasing project discoverability.  While we believe our site can be helpful to anyone wanting to participate in open source, people who participate in open source voluntarily will likely benefit the most as we will be recommending new projects to users based on their interests. Rather than hosting the repositorites ourselves, the goal will be to list any OSS project so that people are able to see the wide range of projects and software that exists and make it easy to find something new to work on.UsefulnessDiscoverability is not a major focus of major repository sites like GitHub. Open source relies on having contributors able to join and help develop projects. Github explore is a basic system that GitHub has to try and allow developers to find new and interesting projects. Our goal is to be a location that developers can use to quickly find something interesting, with a focus on displaying key metrics up front that developers that are looking for a project want to see.RealnessWhen users add a new repository to our website, they can provide a GitHub/GitLab/Bitbucket repo link, and we will pull data about that repository and display that data on our websites, allowing other users to view all of the data without having to go directly to the repository.  If the project is self-hosted or hosted somewhere else, we will allow the submitter to provide their own data about the repository which will be displayed.  We will also get the top 100 repositories in terms of open source contribution from Github and GitLab so that our users will have a base of repositories to browse.FunctionalityBasic functionsAdd Projects: Project owners can add projects to our website by providing a name, description, and link to the github or Bitbucket page of the project.Update Projects: Project owners can change the data of projects that they have added to our website.Search Projects: Users can search projects through name, tag, topic, platform, and languageFilter Projects: In their account page, there will be a list of options which will change what the user sees.  For example, there will be a languages box, and a user could choose to only see Ruby projects.  Users will be able to filter by programming language, platform, and other broad categories.Tag Projects:  Users can add tags that they think appropriately describe a project.  If a tag exists in the database already, it's rating attribute is incremented indicating that it is now a more relevant description of the project.  If the tag does not exist, it will be added to the Tags table.View Project History: Each user will be able to view projects that they own as well as projects that they have contributed to in the past or are currently contributing to.Advanced FunctionalityFinding Similiar Projects: We will have a \"project feed\", which is each user's home page, consisting of new projects and projects that the user has been matched with. We will use our tagging system to help us do this.  We will use the user's project history to help determine new projects that they might be interested in joining.Matching Projects with coders: This will be done by having each user fill out a form on account creation, where they will answer questions about themselves so that we can match them, using some algorithm, to projects that we have on our website.  This will be done only on account creation.  Our algorithm will be related to the algorithms employed by dating websites to match users to other users.  This will involve putting the tags into a matrix and using the least-squares solution to determine the projects that have attributes that match closely with the users' interests.\n", "members": ["jcokki2", "crwllms2", "chlopec2", "askapur2"], "skills": ["java", "php"]}, {"name": "UIUC Event Locator", "desc": "\nDescriptionAn application that allows users to geotag events and classified ads overlaid onto a map of the surrounding location. By default the application uses the current location however the user can do this by dropping a tag onto a particular location on the map.This would allow them to see the different events and advertisements around the tag.The users can create events in our application, we will be storing this information onto our database. We would use the past events information, to create a heat map which shows the most popular locations for events. Additionally, we will be creating a feature to recommend events to the user and we will allow users to pay for the cover fees or products directly through the application.The users will be able to locate the events that their friends are attending. They can also filter events based on time periods, group sizes and specific event categories. UsefulnessThe following applications have features which are similar to ours:Meet upCraigslistFacebookVenmo /PaypalWhat sets our project apart from the applications listed above is that our application will combine the best features of everything listed above. Also it will add a unique and novel map overlay, which will make finding events and classifieds easier than ever before. Additionally, the event suggestion, friend finder and heat map provides functionality that nothing else does.The popularity of specific of location is a valuable data, which many companies would like to have access. RealnessThe user data, their name, id and friend list will be derived from facebook. We will also be using the facebook to log into the application. The user will be able to input their own personal information. The past hosted events and user ratings will be taken from the events created in the application and the users who attended them. For the events and classified, ids will be autogenerated within the application, to provide a unique number. The description, start times, end times, names, locations, max group sizes and fees will be inputted by the user. The map will be taken from the google maps api, we will only be using this to generate the map. We store our own coordinates for the events, and we will be developing an algorithm to fence off specific locations in order to specify where they are bound within the map. We will determine the popularity of the location based on some algorithm which will use the past events data as well as friends that would have visited at those locations in the past. FunctionsBasic FunctionsCreate EventsUpdate Personal DescriptionFilter Events on MapAttend EventClosing off events past max group sizeReview event hostPay for event or product feeAdvanced FunctionsFencing off specific locations: Determining general terms that people use \"the quad\" , \"south field\" that are not necessarily bounded by specific coordinates.This will make it easier to locate the events and determine the popularity of specific locationsGenerating a heat map for location popularityThis is a data visualisation method, which will nicely determine where other users tend to host events in certain cities or campusesIt would be great for universities or property owners to advertise, for example, the engineering quad may be UIUC's most popular event locationSuggesting events for usersThis will be a useful as it will make selecting events for users significantly easier  \n", "members": ["Astha Saxena astha2", "Ram Gupta rgupta31", "Ryan Gates rgates3", "Aayush Sharma asharm52"], "skills": ["python", "java"]}, {"name": "Tripub", "desc": "\nDescriptionOur project enables people to create, edit and share their travel plans online. We hope to create an online community for those who love traveling. Our project will allow people to share their own experience as well as communicate and exchange ideas with others.UsefulnessTripAdvisor, Triphobo, and Kayak are all similar websites, which provide information about local attractions, hotels and restaurants. But there has not been a website that makes travel a social event. Our web app will create an online community for travellers so that they can share own travel plans, clone and modify others' plans, and chat with people interested in the similar plans.RealnessOur raw data of travelling attractions will be collected from websites already existed out there, such as TripAdivsor. TripAdvisor provides APIs for people to access their data. Some other data can be collected from web crawlers we wrote. FunctionalitiesBasic FunctionsUsers could log in through Triphub authentication system with their own user names and passwords. They could also create and edit their own profiles.Plans should be created by users. Days should be appended to a plan by the user who originally create the plan. For a day created by the user, elements such as sightseeings, hotels, restaurants and transportation could be added by the user to the specific day.Users could also copy plans created by others, edit their plans, delete their plans.Other users could add comments to plans post.Plans could be searched by users according to sightseeings, plan names, transportations, hotels, restaurants. Advanced FunctionsRecommendation System: User's traveling plans will be analyzed by a python program, with the help of ML libraries. When user is creating new plans, at least 5 \"things to do\"s will be recommended to the user based on data analyzed.Forming a travel group and chatting online: Users having similar travel interests could form a travel group by sending a request to a travel plan owner when they browse a specific plan on our website. After the owner approves this request, they can open a live chatting room and chat about their plans and share informations in real time.\n", "members": ["Songyu Li sli111", "Ruiqi Zhong rzhong5", "Chang Xu changxu2", "Zongyi Wang zwang195"], "skills": ["java", "php"]}, {"name": "Dream Deals", "desc": "\nDescriptionThis application works with a real time web crawler to find prices of searched product from online retail stores like Amazon, Costco, Walmart, Sam's Club, Target, eBay, Jet, BestBuy, Kohls, Macy's, JcPenny and Sears. The prices will be displayed based on filtering decided by the user with links to the product page on original website.The application will allow users to create a profile and add other users’ profile to a friend list called “My Gang”. The user will be able to share his/her wish list with users in his/her friend list. His/her friends will be able to provide feedback (in terms of comment) on each product on the wish list.Another feature of the application will track historical data of product prices over a period of weeks and provide a predictive scoring indicating the best time to buy the time.UsefulnessThis application extracts products information from various online retail stores and provides the price information without having to browse websites individually. This not only saves users’ time but also provide a comparison tool of product prices in one page. The product selection list on the application can be also determined by certain advanced filters indicated by the user. For example:Products that qualify for free shipping;Products that are sold by the third party;Products that have customer reviews of greater than 4 stars.This above filtering is unique in providing the user control over search algorithm.Some online retail websites allow the sharing of wish list with friends but does not have the inbuilt facility of allowing friends share their feedback on the product shared. A friend in the “gang” can be an expert on a product and may suggest buying the same from a different brand. All feedbacks between friends can either be public or private based on user preference.Plotting minimum price of a product over a period of time can be a major advantage in the decision making process of user. From the historical plot the user can gage the time period when he/she gets the best deal on the product and plan his/her finances accordingly. The application will obtain historical data of product price by using a web crawler at certain intervals from website of retailers.RealnessProduct data will be crawled from online retail website like Amazon, Costco, Walmart, Sam's Club, Target, eBay, Jet, BestBuy, Kohls, Macy's, JcPenny and Sears. User data will be generated manually by users accessing the application.Basic FunctionsUser can access the application as a guest. Data about the product prices will be crawled based on user search criteria mentioned above under Usefulness section.Inserting records will occur when users create their account and when users create wish list. Last five products searched by a user will be recorded in the database and will be displayed when the user logs back in.Updating records will occur when users send link up request with other users and share wish list and when the application crawls new data about product prices.Users’ accounts and wish list can be updated or deleted from time to time.Advanced FunctionsSocial Media and Recommendations: Friends in the user’s friend list can provide feedback on each product in the wish list. Feedbacks will be inserted into the database. The feedback can either be private or public based on the feedback providers’ preferences. We will also show a recommended list of friends and items one can buy.Historical Data:Web crawler will run periodically to save pricing data of various products to the database. The user will be able to pull out the historical price of saved products over a certain period of time. The price tracker will also provide a predictive score which will help determine the best time to buy the products.  \n", "members": ["lliu65", "kodeswa2", "hanjinh2", "sghosh12"], "skills": ["python"]}, {"name": "Booking Up", "desc": "\nDescription: Right now, dating applications are very superficial, with people selecting potential mates based on physical features. We aim to overcome this problem with modern day dating by connecting people through more substantial interests - books! Booking Up is an application that matches people up based on similarities in their reading tastes. Users input their personal information and their interests, like favorite books, authors, and genres, and an algorithm will present them with a list of potential matches that they share similarities with. The user is then free to start conversation with a match if both have expressed interest in the other.Usefulness: There are plenty of dating sites already available such as Tinder and Bumble. Our application is unique because it connects people based on their readings interests over something more superficial. Our application is useful because it caters to the crowd who are looking for a meaningful relationship that they aren’t able to find on available dating platforms and allows them to form connections based on something more significant. Realness: Our book related data such as authors, genres, and book titles will come from web-scraping Goodreads while the rest of the data will be user generated.Basic Functions: For the initial choice of books that users can select, we will be write an automated web-scraper that will select the 100 most popular books. In addition, we will have 10+ developed accounts, of users, who will potentially be matched.Some possible examples of inserting will be adding to new users to the application and updating will be change the user’s book preferences and characteristics.The interesting queries would be joining the book and user tables  in order to join users that like the same book or similar genres of books for potential dates and we will be able to print potential joins. Another potential query is creating a table that would contain all the information on the books that a user has liked.Advanced Functions:In order to connect people with others who best match their reading interests, we’ll be implementing a ranking algorithm. This will sort people into a list with those who have very similar interests, like a particular book, in the beginning and less specific interests, like a common genre, towards the end.We will also be implementing a feature that allows users to see which book, genre, and author led them to the most “successes”, with success being defined as conversation initiated after a match.\n", "members": ["Ria Nair", "Devashri Nagarkar", "Kavya Varghese"], "skills": ["python", "java", "php"]}, {"name": "College helper", "desc": "\nTitle: College helperSummary College helper provides various tools for students to manage their academic life.DescriptionCollege helper is a website which helps UIUC students who major in CS, ECE and ECON to schedule classes and to communicate with other students who have same class.Firstly, every student has to decide what they will take next semester. Sometimes this is a pretty difficult job. Suppose one student has a tough semester so that he cannot spare the time to meet his academic advisor. In this case, he needs to check several websites to list future classes and this is a cumbersome process. But with College helper, this job can be done easily. We offer easy managing of a student's academic life. Depending on major, standing and interest, students can get a best-fit of their class schedule. Also they can track their GPA and academic progress which indicates remaining credits and requisite courses to graduation.Secondly, we offer a forum for students who want to find a study-group or share an opinion about a certain class. Many classes use Piazza to ask a question or have a discussion but after finishing the semester, the Piazza system is no longer was managed by anyone,so it is really hard to get useful information for a student who wants to take that class in the future. As soon as a user adds a course to his course timeline, he automatically joins the registered class forum and he can see past discussions, look for study groups easily and use this website as his secondary tool for future classes.UsefulnessCollege helper is useful in two ways. Firstly, they can easily manage their academic work. There are several websites that offer this functionality. Namely, UIUC enterprise, compass 2G and moodle. But the functionality is spread out over these websites. For example, we can see GPA, earned credits, and standing but there is no way we can find a best-fit schedule depending on several factors like preference and major. So it will be absolutely useful if student can use such a system. College helper aims to bring the functionality of all these websites to one place. There is also no centralized source where a student can find opinions and discussions about classes from past students. There are several websites that provide similar information  like ratemyprofessor.com or koofers.com. But often times, they only show student’s opinion about the professor and not the class itself. College helper offers a simple forum where a student can easily find and interact with students who have taken the course before.RealnessGenerally, we have two data sets: one for the course timeline and other for forum.For the forum, as posts are made by users, we will be storing the threads, comments, user information, date/time of post and which thread each comment was posted in. This data will accumulate as the website is used. There is no initial data.For managing system, we need student’s academic records and information of classes. First of all, user will type basic information like his GPA, taken classes and standing when they sign up to the website. Data about the class will come from each department websites and course catalog provided by UIUC office of registrar. After gathering data, we will combine the information and make a more interactive and comprehensive databaseDescription of functionalityBasic Functions: Add,  remove and view courses from the course timeline. Courses will have all the relevant course information like credit hours, professor, etc. Each course will be assigned a difficulty based on the average grade of students from past semesters. The website will basically be like a combination of DARS and the course catalog. The website will also offer information about core course requirements for graduation depending on the user’s major. Each user will be able to login and view/edit their course timeline and plan out their four years in college. Advanced Functions:We plan to offer an autofill function where depending on the user’s major, we will display a completely filled timeline that would show when the user should take each course over their 4 years. This would require a combination of information about what each major’s core courses are and in what order they need to be taken and how they can all be spread out over the 8 available semesters. This feature can help new students get an idea of what their college timeline should look like and they have some kind of default timeline to begin with which they can then edit according to their preferences. We also plan to offer a forum/message board where students of the same major can communicate. Each major would have their own message board where users can post comments and discuss various things or ask for help if they need it. We can add further complexity by adding tags to comments and then letting users search for comments that only relate to a particular class that they are interested in.  \n", "members": ["Suyoung Park", "Janak Mehta", "Felipe Arias", "Taiyu Dong"], "skills": ["java", "php"]}, {"name": "On The Rise", "desc": "\nDescription: We plan to design a web application which promotes lesser known artists and connects them with a broader audience. Usefulness: Our application has the potential to act as an avenue for independent artists to have their own break in the music industry. It also provides listeners the chance to broaden their musical libraries with unique songs that the mainstream industry does not create.  Realness: We are looking into the Soundcloud API or using a web-crawler in order to retrieve the necessary data (i.e date posted, number of views, like/dislike ratio, etc). We will also incorporate user data in the form of user voting. This will be used to adjust our algorithm in order to better recommend music to a individual user's tastes. Description of Functionality:Basic Real Data:Soundcloud API TracksUser Profiles Insert,Update,Delete Search the database, List or Print returned resultsAdvanced Promotion of ArtistsMusic Suggestions based on User VotingCommenting On Songs (not supported by current database design)\n", "members": ["Douglas Jennings dgjenni2", "Quang Dang qpdang2", "Naresh Ganduri ngandu2", "Chris Fischer cjfisch2"], "skills": ["python", "flask", "java"]}, {"name": "Buddy and Game Finder", "desc": "\nProject Title: Gaming Buddy FinderProject Summary: We hope to build a platform that allows gamers to quickly find like minded people to game with.Description: We want to build a web application takes in user information via manual input and also by connecting with their game profiles in order to match gamers with others based on interests, skill level, location, etc.Usefulness: People nowadays are feeling depressed and games are often their only option to escape reality. By using our platform, we offer a user friendly yet useful network to link between gamers to promote relationships. It will be useful for busy, lonely people, whether they are students, businessmen or what-not who have no time to build large communities of people to game with, a chance to interact with people. Our platform aims to provide a quick match between users to play games of their favorite, and possibly build a feedback system on the users of their friendliness, helpfulness on games, or other features. Our platform is different from existing platforms because other apps generally provide a list of players based on a very broad search so the user has to do most of the work going through all the profiles and find a good fit. Our recommendation system will do this work for the user and provide a quicker, less frustrating experience.Realness: We will be getting data from users. The data will input their interests on the genres of the games, the platform of the game the user uses, the skills of the users, and the user profiles. The profiles will include the languages, the ages, gender and similar interest outside of games so that when users become friends they can have common interests that will promote the relationship. We will also pull statistics from various websites such as Steam to add on to the profiles.Description of the functionality that you plan to offer.Basic Functions: The basic functions will be adding user profiles and inputting appropriate data. Also, we'll have player circles, a review system to give feedback on who was fun to play with, and Advanced Functions:We will have a recommendation system to suggest matching players using a decision tree.We will add on to profiles by connecting accounts with platforms like Steam and retrieve necessary information from online sources to enhance user profiles.\n", "members": ["Deepak Mani dmani2", "Sho Harisawa harisaw2", "Keji Chen kchen52"], "skills": ["python"]}, {"name": "InternX----an internship hunter only for students", "desc": "\nDescription We are going to do a very formal internship websites only for college students. Many internship websites right now are not that useful. We are going to get all the resources of top companies websites and from schools, and then post to our application. We do not invite recruiters. What we do is to set a big database for internship for students to search. Simple and clean.Usefulness.  There many internship websites in the market right now, and most of them are complicated and do not have a focus. Many universities also have their own career service, however, in our application, we are only a big search engine and a useful platform for college students to find internship. It is simple and efficient. We manipulate our methods of computing and data collecting to gather as many internships as possible to put on the websites to let students to search with a simple search. There are no fancy and complicated structure, but just all the information for internships.Realness.  We will have company names and the positions each company provides as our data. User information is also a part of the data. We will crawl the position information from the webpages of the companies.Description of the functionality. Basic Functions: Position Lists:The webpage crawls top 50 companies from different fields occasionally and lists the real-time open positions (outdated positions will be deleted from the database).Sign-up/ Sign-in:User will be recommended to register first so that the webpage’s advanced function can better work for the user. There will be two ways for the user to fill in the registration form: he can either type in the information manually; or upload his resume and check the autofill from his parsed resume. (The webpage will provide parse and autofill function.) The user is welcome to re-upload a new resume, edit or delete his information later.Favorite Positions:User can bookmark/unbookmark his interested/favorite positions. He can check these positions as a list in his home page. He can rearrange the order of the bookmarked positions in his personal position list.Advanced Functions:Resume Parsing:The webpage will parse the uploaded resume and autofill the registration form for the user so that the user doesn’t have to type in the registration form (usually long) by himself.Job matching:The webpage will search the data base and match the user with his suitable positions. The match will use the information such as major, interest, past experiences, fluency level of skills, etc as references.Job search engine:This function is similar to the previous one but this function enables interaction from users. User can type in any key words and the engine will search the most relevant result for the user (just like a normal search engine, but only job positions will be listed).\n", "members": ["Wenzheng Hu whu14", "Zeyu Wu", "zeyuwu2", "Mingli Yang", "myang46", "Xilun Jin", "xjin12"], "skills": ["java"]}, {"name": "Viz.io", "desc": "\nDescriptionThis application is a real-time data visualization tool that takes in any type of data such as, sensor data or stocks, and produces a real-time visualization model of the user’s choosing. There is also an option for predictive analysis, which finds correlation between the different data points inputted into our tool. The problem we are trying to solve is the lack of optimal real-time data visualization. Our solution is to create a seamless tool that takes in variable data inputs and presents a user friendly model with API capabilities. UsefulnessThere are existing tools made from utilities like D3.js that are able to visualize an inputed dataset. However, currently, there is not a similar application capable of data visualization for such a wide range of datasets, from stocks to Internet of Things. Our application is a one of a kind tool that makes viewing data simple and can adapt to any user’s needs. What makes us different is that there is a vast amount of data, especially with things like IoT, that do not have a clear means of communicating what the data means. Our advanced functionality solves this problem.RealnessOur data is real data fed from existing datasets (from both hardware like sensors or Nest thermostats as well as software such as Stocks APIs). It is continuous and versatile, meaning that there is a constant stream of data. The beauty of this application that essentially any data can be inputted and our application will adapt to meet the needs of the user. FunctionalityBasic FunctionA couple of basic functions include importing data, creating and managing user profiles, manipulating the database of data, and printing out data info. For the demo, we are going to simulate data from a sensor by creating a script that will generate random numbers from multiple sensors. In addition, each user will have a different database for their specific data. Once the data is imported, the user can insert, delete, or update the data (3 of the CRUD operations). The data will also be categorized by either sensor in our sensor example or by companies for the stock example.Advanced FunctionPredictive analysis - cool to have this because it can allow users to extrapolate further and use our application to make their own conclusionsComprehensive API support- cool to have this because it can allow us to make our product open source such that other users can modify the codebase to optimize the real-time algorithms, etc.Data visualization- cool to have this because there is a vast amount of data, especially with things like IoT, that do not have a clear means of communicating what the data means. Our advanced functionality solves this problem.Managing multiple user sessions and keeping them isolated- many apps have scenarios in which multiple users are using the site at once, but ours involves modifying a common dataset (e.g. stock data) while keeping this modification isolated to that userReal-Time- cool to have this because instead of taking pre-gathered data (like what D3.js or other tools do) we can optimize and render to deliver immediate resultsHours spent implementing the above functionalities \n", "members": ["hanke2", "katyal2", "galeks2", "tshah29"], "skills": ["python"]}, {"name": "Auction Central", "desc": "\nDESCRIPTION/USEFULNESSWe will be creating an auction site with a social media component. eBay is the leader in the online auction world, but due to the fact that nearly any product can be publicly sold on eBay, it is often difficult for the user to find what he/she is looking for. One reason for this could be that sellers are not able to target their auctions to certain groups of people, requiring the buyers to scroll through many unrelated items to find the product they desire. Additionally, Facebook has buying and selling groups, for example, UIUC’s Textbook Exchange group. These groups lack the ability to coordinate auctions (they simply have a \"Message Seller\" button), so sellers can easily overprice or under-price their products, which is sub-optimal. We seek to harness the strengths of both services by combining them together into an auction website allowing you to only see auctions that are of interest to you.REALNESSOur product data will be collected from Amazon. We will be \"auctioning off\" these products. In addition, real people will be creating the user accounts and we will create pre-made groups for common interests, with the ability for users to create their own groups.BASIC FUNCTIONSThe basic functions of the website include:Create user accountsLog into their user accountsPut items up for auction, specifying a start and end date, and upload an imageAssign products to a category, where categories are hierarchical and can contain sub-categoriesBid on itemsCreate auction groups under specific category(es), specifying the location of the group and, if desired, the radius, outside of which users will not see the group (discussed more below)Delete their own groupsJoin an auction groupEstablish connections with other users (similar to any other social media site)ADVANCED FUNCTIONSRecommendation SystemOne advanced feature will be a recommendation system, requiring the use of machine learning algorithms.  We can use this to suggest new auctions to the user based on what groups they are a part of, the product itself, the popularity of the product, in addition to other features.  We can use a similar algorithm to recommend groups to users. Search by LocationThe other advanced feature will allow the user to specify a \"central location\" geocoordinates of a group, if desired (this would be useful if the user wanted to create a local group, say, only for Urbana-Champaign residents). Then, any user could search for nearby groups and be presented with this list. To obtain the geocoordinates of users or groups, we will use the Google Maps API to retrieve these coordinates. They will then be stored in our database, and we can use the spherical distance formula to compute the distance between two of these geocoordinates.\n", "members": ["Daniel Calzada", "dcalzad2", "Haoran Wang hwang293", "Changsong Dong cd6", "Xiaochen Hou"], "skills": ["java", "php"]}, {"name": "NBA Game On", "desc": "\nDescriptionWe would like to create a platform where basketball fans can have improved experience during the game season. Based on users’ favorite teams, players and other information, we will recommend match-ups and relevant information (such as pre-game and post-game news, game statistics) to them. After watching games and relevant news, one user could favorite games and players, and leave comments about the game. Based on feedbacks, we will adjust our game recommendation. We will also do some manipulation and visualization of  game statistics, which will give users more insight into games.Usefulness State as clearly as possible why your chosen application is useful.  Make sure to answer the following questions: Are there any similar or equivalent web sites/applications out here?  If so, what are they and how is yours different?1. Avoiding repetitive and unavailable for game information, users could find what they want at one place.2. Improving user experience by offering personalized gaming schedule. 3. Equip users “statistics” insight so that they could have more to talk about with their friends.Realness Describe what your data is and where you will get it.Relevant data involving  teams, team players, game location, game stadium, game time and relative pre-game and post-game news will be obtained from prevalent NBA websites such as stats.nba.com. For user-input data, we will invite friends to register on our websites to collect sufficient user information. FunctionalityBasic Functions:1. Collecting data from prevalent sports websites by APIs.2. Admins could insert/delete/update the user information and game information.3. User can search the game by related information such as teams, players and game time.4. Users can create their preference list of teams and players and request recommendation from the server.  5. Create a comment board for users to leave their comments for the games.Advanced Functions:1. Recommend games and relevant information based on players' preference.2. Data manipulation and visualization of game statistics (Tentative application, we will show team performance in home games and road games, which will indicate whether there is home court advantage for one team)\n", "members": ["keyez2", "rsun22", "chengd2", "yuboo2"], "skills": ["java", "php"]}, {"name": "IlliniPost", "desc": "\nDescriptionIlliniPost is a platform that is designed for UIUC students in order to let them study, make friends, and relax better. At IlliniPost, there are three main sections including Q&A, entertainments, and classes information. In these three sections, students can post questions, reply, and keep track of certain posts they focused. For the user who doesn't want to sign up an account, they can use keyword search to find useful information they are looking for and also ask or answer questions. For the user who has an account, they can own a custom page after they login so they can focus on the category they care about most. By using at IlliniPost, students of UIUC can have easier and happy daily life.Usefulness(Why useful) First, Many UIUC students such as my friends have many questions about classes such as how many working loads does this class have, how to get A in this class, and where are the chatting groups of this class, and etc. They are also interested in finding good restaurants. However, currently, there is no single platform that can answer those questions together. Students have to find those questions separately,  and in most cases, they failed to find the answers of those questions because of lacking resources. However, our platform can collect answers of those questions together, and students can post and answer all the questions they focused on this platform, which is very convenient and useful.(Similar applications and their disadvantages) Currently, Yelp can recommend good restaurants, RateMyProfessors can recommend good professors, and Piazza can answer some questions about classes such as how many working load does this class have; however, each of them only has one single function, and students have to go to those websites one by one in order to find the answers. What's more, RateMyProfessors' answers are out of date since it only has the few answers about professors, and sometimes it even does not have any interviews about new professors. Piazza do have some answers about some classes, but they are not sorted well, and students sometimes who have taken this class could not see those questions at Piazza on time, so that they could not answer those questions.(Why our platform  is different) Our platform, the IlliniPost, can solve the above problems well. Since it is a unique and single platform that contains different sections, students can post all their questions in sorted sections, and students who want to answer those questions can see them on time by looking at specific sections. What's more, we will update the questions and answers on time so that users will not see the out of date information. Unlike Facebook, Twitter and other social networks, illiniPost aims at connecting the previous, current and future UIUC members, and together to make UIUC a better community.RealnessOur website contains data from three parts: Q&A, entertainment and academic. We plan to use Web spider (python) to get data from various website. For Q&A and academic, we can grasp data from reddit, course hero, Quora and Blogs. For entertainment, we can see reviews from Yelp, Facebook and twitter.Also we can add data manually by either writing blogs and registering on our own or inviting UIUC students to post there blogs and questions in our website.Description of FunctionalityBasic Functionality Insertion: People will need to post their questions, answers and experiences on illinipost, so adding those data to database will be essential.Deletion: Since we decide that unregistered user can also make a post on illinipost, it will be necessary for the administrator to delete spams and out of date posts.Update: For the user who wants to add or edit their post, update information to database will also be necessary.Search, list and return results: Search and return also play important roles in our website for users who is looking for a specific content.Advanced FeaturesHot-key clouds: In the main page, we will cross data from different websites, and analyze the search in our website. Present the popular keyword in the main page in a circle and all the keyword will move constantly in the circle clouds.  Trace tracking: Based on the search data and post data, give user a customerized main page category showing in their main page.  \n", "members": ["Rita Liu", "Hao Yang", "Nuochen Lyu", "Siyao Zheng"], "skills": ["python", "java", "php"]}, {"name": "Tag Along", "desc": "\nDescriptionIt is a ride sharing android application that lets you find people driving to where you want to go and hitch a ride with them. It solves the problem of having to rent a car or take a plane if you are going far away, and also reduces the overall cost of the trip per person by splitting up the cost for more people.UsefulnessOur application is useful because it provides an easy and convenient way to get somewhere that you need to go if you don’t have a car or the money to rent one. Instead, you can carpool and use this app the find the person to drive you.There are similar ride sharing applications that already exist, such as Hitcharide, Ride, and Carma Carpool. Our application will be different because it will allow you to string together multiple rides and locations, as well as get off before the intended destination, in order to more flexibly allow people to get where they need to go.RealnessWe will use fake user posts as our data. Each fake post will be a user saying that they intend to drive somewhere, and then other users will be able to browse through these posts to join the rides. Also, we will use fake user comments that people leave on other people’s profiles as data. Advanced FunctionalityBasic FunctionsBe able to create an account and log in to which is personal to each userBe able to create rides that other users are able to join. Rides will be update-able with new information (i.e. driver decides to change price).Be able to browse for rides that are near you or go to/start from a specific location.Be able to leave comments on users profiles, and upvote/downvote/delete your comments those comments. Be able to reject/accept requests from riders to join your ride if you are a driver.Advanced FunctionsWe will use flexible graph traversal algorithms in order to connect riders with multiple ride providers in order to provide the best overall route from point A to point B. This is a cool feature because even if there is no ride going directly from point A to point B then you will still be able to get there - by going from A to C to B. Additionally, it will allow users to find the shortest trip- or even find the cheapest trip if they so choose.We created a variety of data visualization options integrated with Google Maps and using our databases in interesting ways to provide visualizations for the users to see statistics about rides and the app. This is a cool way for the users to interact with the application and view interesting statistics collected from ride data.\n", "members": ["Dan Volchek volchek2", "Dmitriy Liokumovich liokumo2", "George Gunter gunter1"], "skills": ["java", "php"]}, {"name": "Build your PC", "desc": "\nDescription:We want to build a website that allows users to be able to buy all the components required to build a computer. This site would be allow the user to work with specifications (like size of computer, data processing speed, screen resolution etc) and still generate a component set which has every required component to build a PC.Usefulness:Our website is useful to people who would like to build computers for specific needs and for people who are generally interested to not go with market based ready-made products, which can be significantly more expensive.There exists a website which is somewhat similar to what we are creating, pcpartpicker.com.However, it has no way of recommending how to build the entire pc. Our website would be specifying exactly what components would be appropriate given a certain number of restrictions to work with.Realness:Our data includes the various specifications of several types of PC parts.Example:There would be a relation for disk memory which would have the attributes of price, capacity and name of the disk memory. We plan to gather our data by crawling data from multiple websites. To list some of the websites we plan to crawl the data from:Amazon.compcm.comNewegg.comBasic Functions:As mentioned in project description.Advanced functions:Recommend a combination of PC Parts to user based on high-level specifications (like price, case form factor, VRAM, or allowing specification of individual attributes of parts)Allow users to publish sets of specifications and allow other users to use them as a subset of specifications in their queries (for example, “good gaming build” could be “CPU clock speed > 2 GHz, graphics card has at least 2GB VRAM, system has at least 16GB of RAM” and then a user could use this and further stipulate “the whole thing costs less than $1500”).This includes having to maintain a record of the user’s input sets and since not every published set could be held record of and showed to other users, we need to keep a ‘like’ system in which other users are allowed to like the specific set that others have published. The sets with the highest likes would be shown to other users. This would be a very dynamic feature changing as per the number of likes on any set.\n", "members": ["Agrima Bansal", "Daniel Schwartz", "Nodens Koren", "Varun Jain"], "skills": []}, {"name": "DropMuse", "desc": "\nDescriptionDropMuse will allow users to signup to receive playlist recommendations based on the types of songs they enjoy. Users will be able to enter specific songs and keywords, and DropMuse will make a playlist that is specifically relevant to that input. We will scrape song lyrics to provide the ability to search by relevant keywords and provide more accurate recommendations. Users will then be able to offer feedback on the generated playlists, which will allow DropMuse to refine the recommendations to become more relevant to what the user wants.UsefulnessServices like Spotify generate playlists, but do not let users create playlists from keywords. We will be able to generate more relevant playlists by letting users seed our recommendation algorithm with songs and keywords that they are already interested in. We will also place an emphasis on using lyrics for song recommendations, which many other music services do not currently take into consideration.RealnessWe plan to scrape our lyric data from sites like Genius, AZLyrics, Lyricsplanet, etc. By combining these disparate sources of lyrics into one centralized service, we will be able to leverage this data to provide better recommendations. We will scrape song genre data and metadata from other music services like Spotify and Last.fmDescription of FunctionalityBasic FunctionalityUsers will be able to sign up for accounts, and create playlists seeded by keywordsUsers will be able to navigate and view their playlists, and click links to listen to the songs.Users will be able to share the generated playlists with friends.Advanced FunctionalityWe will perform sentiment analysis and entity extraction on our database of lyrics to better inform the algorithm we will use to generate playlists. Our idea is that lyrics hold a lot of latent information about songs, so careful and automatic analysis of the lyrics will allow for better song recommendation than is currently available. Users will be able to thumbs up or thumbs down tracks on each playlist to indicate whether or not they thought that track belonged in the playlist.We will create a generalized scraper to scrape the variety of publically accessible lyrics website to create a large dataset of song lyrics. This scraper will be general enough to support the major sources of online lyric information.\n", "members": ["Benjamin Congdon", "Genevieve Helsel", "Patrick Hurtado", "Drew Zelac"], "skills": ["python", "flask"]}, {"name": "2RedHearts", "desc": "\nDescription Campus-based online dating social network website. Aiming at helping students to find their girlfriends/boyfriends on campus.Usefulness One of the biggest concern among college students is finding boyfriend/girlfriend. Why?Students from engineering say there are too fewer girls in the same class, and girls from business college say that too fewer boys in the same class. With that being said, the gender ratio across colleges are very unbalanced. For students who spend most of their time in classes, labs, It’s kind of hard for them to find proper people to date.There are apps like Tinder, which can show people around. But it cannot restrict to a specific campus. Students tend to find their boy/girlfriend who is also students in the same campus. Our web aims to help only registered students to find their true love. RealnessUser data: Personal information, for example, name, age, major, interests, gender and brief self-introduction. This data is obtained through user registration.Geographical data: campus places, for example, library, building, coffee shops. This data is obtained through manual input.Functionality that you plan to offerBasic functions:Insert/delete comments into database when users creates/deletes commentsUser profile editingSearch for users by filterHomepage, display popular usersComment boardAdvanced functions:Recommended People (based on friendship network, preferences, etc.)Come and Greet, Recommended Places (based on geo location)\n", "members": ["Shicheng Zhou", "MingKang Yang", "MengQiao Zhang", "Tiangang Chen"], "skills": ["python"]}, {"name": "Stream Soup", "desc": "\nDescription: Stream Soup is an application that aims to help users by recommending TV shows based on the streaming services they use, their previously watched shows and their general entertainment preferences. The problem Stream Soup is attempting to solve is the disconnect between different streaming services and the content that they provide. A user should be able to simply check Stream Soup to find new/existing TV shows as opposed to logging in to several streaming websites such as Netflix, Hulu, Amazon Prime Video, Crunchyroll, HBO etc. Along with this, there are several other features further explored in the functionality description section. Usefulness:Our application is more efficient than currently available resources because it eliminates the need for users to log in to various applications in order to find TV shows. The main competing application does not provide extra services that Stream Soup would, such as user reviews, recommendations (based on user preferences), integration with Facebook and usage analysis.Realness:Firstly, the primary database required for this project is one containing all of the different available streaming applications. Several streaming services provide a list of the TV shows and films available. Using a basic web scraping tool, such as \"Beautiful Soup\", the relevant data can be extracted and combined to form a larger, more comprehensive database. Several attributes of each show would be recorded such as cast, genre, release year, etc. Another category of data Stream Soup would require would be the information about the users, their reviews and their streaming preferences. This would be obtained using Facebook and user-inputted information. Connecting to other review-based websites (eg. Rotten Tomatoes, imdb, Metacritic) can be directly accessed as opposed to expanding our own database.Functionality Description:Basic Functions:Searching TV show database by attribute such as title, genre, year of release, cast member etc.Add/Remove shows based on new releases/removals from servicesAbility for user to add reviews for TV showsLink to rating websites Advanced Functions:Integration with Facebook to get friends’ recommendationsThis is cool because having friends is cool (or so I’ve heard). In all seriousness, it provides a dimension of interactivity between friends and finding people with similar interests.Usage analysis of various streaming services.This is cool because one can review the TV shows that they’ve seen on various services and determine which ones they would like to continue paying for and satisfy their curiosity in knowing how many hours of my life did I spend watching TV this year (cue existential crisis)?Weighting of user reviewsThis is cool because not everyone uses the same mental scale to review shows, therefore this would normalize the data and give a better depiction of the overall show rating.Concerns:A lot of the data we require is not necessarily available for use, and therefore we anticipate running into certain roadblocks in the creation of Stream Soup. However, as with any project we plan to be adaptable to available resources by being dynamic with our functionalities.  \n", "members": ["Daniel Zurawski (dzuraws2)", "Avery Clark (ahclark3)", "Yantong Zheng (yzheng56)", "Parul Agrawal (pagrawl5)"], "skills": ["python", "java"]}, {"name": "Tweetory", "desc": "\nDESCRIPTIONTweetory is a project that aims to provide a better understanding and visualization of events that are happening across the world. The user will be able to search for keywords in the tweets and also see how tweets relating to a certain event are spanning the world.USEFULNESSThe project will allow users to get a better understanding of how daily events are impacting the world. Many a times a horrific event does not get covered because of where it happened. Sometimes people do not truly understand how the entire world has reacted to a certain event. Through our project, the user will be able to get a better understanding of what’s happening around the world and how people are reacting to it. REALNESS We are going to majorly use data gathered from the Twitter API thus ensuring that all data is real. The API also allows us to get location information about every tweet which we will use to determine how people around the world are reacting to an event. FUNCTIONALITY      Basic Functions Updating the tweets data in real time.Use data acquired by using the Twitter APISearching through tweets to show the responses to an event. Using hashtags.      Advanced Features Data Visualization - We plan to map the tweets collected onto the world map based on certain hashtags. We will use the geodata associated with a tweetData Mining - We plan to use data mining to determine what are some keywords that are common to the tweets relating to a certain hashtag/event.  \n", "members": ["Utkarsh Jha ujha2", "Ishaan Kansal ikansal2", "Jaehoon Shim jshim10", "Deekshant Kaul dkaul2"], "skills": []}, {"name": "Spotlight", "desc": "\nDESCRIPTIONSpotlight is an application that attempts to tackle the ongoing problems with mainstream media. The user will be able to upload unbiased content in order to pave the way for the new wave of journalism. The application will allow for a medium in which every day people are truly in charge of what news they consume by cutting out the middle man and obtaining primary sources of information. USEFULNESSThis project will bring transparency, accountability, and clarity to the way we find out about injustices in this world. People always complain about a news outlets heavy bias whether it be right leaning or left leaning. This application will allow users to create unadulterated content for the masses. REALNESSThis project does have real world uses, as people will be able to share content that they have encountered in their daily life with other users of our app and with people around the world if they choose to. FUNCTIONALITY      Basic Functions View media(audio, video, pictures) from users through a user feed Comment on media Post media to the feed, and add tags and a description to this media      Advanced Features  Data Management: Several key pieces of data will be both stored in and retrieved from the database in real-time (or close to real-time) User Experience: Although this seems like something belongs in the \"basic functions\", our UX will be one that the user is familiar with and has used before, but also one that is unique and jaw-droppingCustomize a feed for each individual user, if they choose to \"like\" or \"ignore\" media with certain tags\n", "members": ["Haaris Khan hkhan11", "Kunal Shah kbshah3", "Aashish Kapur askapur2", "Varun Jain vjain10"], "skills": null}, {"name": "NextGreatChef", "desc": "\na. DescriptionWe would like to build a recipe sharer web application that helps our user to learn and share different recipes from all over the world. Transmitting the cook culture worldwide.b. UsefulnessThere exist a few cooking tutorial websites/applications already. However, they either only focus on bakery or just sharing American style recipes. Our web app will be more comprehensive that includes worldwide categories such as Chinese or Indian recipe.Our website will provide a text and image based online cooking tutorials for users. They can search the ingredients they want to use in our website and get lots of different recipes for the ingredients they searched. Since a lot of people are having problems cooking meals or deciding what recipes they should cook, our website will both provide lots of recipe choices and a detailed text tutorial for each of the recipe in our database. The similar things compared to equivalent websites are basic layout for the main page and the recipe page, but we will provide a data visualization for user’s browsing history.  c. RealnessWe will collect our recipes from various sources: popular recipe websites, user inputted recipe, and our own recipes.d. FunctionalityBasic Functions:User can create an account by providing basic information such as username, password, real name, etc.Insert function: User can add his/her own cooking recipe to the databaseUpdate function: User can modify the recipe and update it to the databaseDelete function: User can delete his/her own recipe from the databaseSearch function: Given ingredients or keywords, user will get a list of corresponding recipes          Example:                   -If you search “beef”, you can get a list of recipes which contains beef.                   -If you search \"american\", you can get a list of american recipes.Advanced Functions:Recommendation:  We will recommend some recipes to user based on user’s viewed history and the maximum intake of calories he/she want.MapOfFavorites: Initially it’s a world map with several images of different countries. When the user add a recipe that belongs to certain category in their favorite list, it will show up on the favorite map. For example, if user add a kung-pao chicken into their favorite list, then when user click the image on the corresponding position(China's land), a list of his/her favorite Chinese food will appear(and it should only have kung-pao chicken as its element by now.) Next time the user add certain Chinese food as his/her favorites, he/she should expect an update on that list. And we will update the list once the user add a recipe into the favorite list.\n", "members": ["Xuanyi Zhu", "Yuxi Gu", "xa0Jiaying Lin", "Praniti Sinha"], "skills": ["java", "php"]}, {"name": "TeamMatcher", "desc": "\nTeamMatcherProject Summary: The project aims to create an environment that simplifies teamwork among students and professionals who want to embark on new technical projects. Such service will be provided by saving user information on database systems. Furthermore, the system will use the stored data to recommend possible team compositions to user who have expertise and interests well suited for the project at hand. A.DescriptionWe intend to build a system that helps students to form a well-balanced team for a specific project. For example, for CS411 this year finding a team was a challenge as the class is very large and there are too many students/projects to consider. Our system would accept the description of the project, a set of skills each student has and will try to find a best match for a group of a certain size.B. UsefulnessSince the system is going to be used for helping students to form well-balanced teams for their projects, it might save their time, result in better teams and eventually lead to more interesting and successful projects. Instead of checking Piazza posts and their emails for hours, in an attempt to find a perfect match, our system will suggest best possible options for a specific student that will be well organized and easy to assess. The system will eliminate the initial confusion of trying to form a team in classes as large as CS411 is.C. RealnessWe will be using a list of descriptions and members from the previous projects of CS411. We also plan to gather our CS411 classmates’ attributes via survey and crawl project descriptions from the project pages. (and form groups within our class and see if the virtually formed groups match the original groups.)D. Description of the functionality that you plan to offer. I. Basic functionsa.Our application will have data from current and past students about projects and either level of satisfaction with teammates, or grade of the project.                        b.Our application will allow a user to create and edit a profile                        c.Our application will allow a user to search for teammates for a certain project and return a list of potential candidatesd.Our application will also allow users to query for students who are in a certain class and return a liste.Our application will allow a user to search for students who have certain attributes II. Advanced functionsa. Our application will order the potential teammates list using machine learning to predict the best teammates and best projectb.Our application will allow users to input available times and figure out what the best time to meet for a given project will be.c. Our application will allow users to link their github and will parse through it to verify their skillsd. Our application will allows users to rate their teammates, both overall and on each attribute, and the users will have a self assigned score and also a user reviewed score\n", "members": ["Walter Jaskowiak(wjaskow2)", "Jaewoo Kim(jkim475)", "Konstantin Evchenko(evchenk2)", "Yuntae Kim(ykim157)"], "skills": ["python", "flask", "java"]}, {"name": "Atacama", "desc": "\nAtacama is a digital library. We will focus on freely-distributable ebooks since we can actually deliver them. We accumulated a database of ebooks from sites like Project Gutenberg and Creative Commons. We allow searching for ebooks, reading ebooks, editting book lists, and visualizing related books.Usefulness and RealnessAtacama is a digital library promoting literacy. Why is promoting literacy important? According to the Nevada Department of Corrections, some prison systems \"plan how many jail cells they will build in the future by how many children are not reading on grade level by third grade.\" We believe that the future of society depends on literacy. Albert Einstein said, \"If you want your children to be intelligent, read them fairy tales. If you want them to be more intelligent, read them more fairy tales.\" Albert Einstein knew that promoting literacy nurtures an intelligent society.Atacama is a digital library and ebook reader whose goal is to promote literacy by remove barriers to literacy. Barriers we address include (i) convenient access to books, (ii) prohibitive cost of books, and (iii) pleasant discovery of new books. The following paragraphs addressed these problems, how Atacama solves them, and how existing services fail to solve them.A public library system serves much of the world. But many people lack convenient access to libraries, especially children. The problem is worsened by budget cuts, limited hours, and even library closings. At Atacama, we believe that the reach and convenience of the internet is greater than that of libraries. Atacama is a digital library which serves books to everyone in the world through the internet.Even with convenient access to a library, the selection may not be satisfactory. Many libraries are small. The inter-library loan system is known to be slow; some request a service fee. Atacama provides instant access to a large library of books for free. Our library consists of free books from Project Gutenberg [note: currently a subset of all the books].After providing access, we believe that the biggest problem is providing a means to discover new books -- too many options may be overwhelming. Eric Schmidt of Google said, \"Every two days now we create as much information as we did from the dawn of civilization up until 2003.\" To remedy, Atacama provides three tools to discover new books: a term frequency-inverse document frequency based search engine, a visual graph with related books, and the ability to share book lists with friends. We hope that these three tools, used individually or together, provide a pleasurable and non-overwhelming book discovery experience.In comparison to existing online services, companies like Amazon and Scribd provide access to books, but often at a prohibitive cost. Projects like Gutenberg provide free books, but lack book discovery features. We combine the best of these services: free books like Gutenberg and useful features like Amazon and Scribd.The main goal of Atacama is to empower society by fostering a curiosity and love of reading. We hope to accomplish this goal by providing an accessible interface to discover and read books. We hope that Atacama will, in-turn, improve society.Description of FunctionalityBasic Functionality - Modern and aesthetically pleasing user interface through a Single Page App (SPA) supporting both computers and mobile devices.- Book reading in the browser- Booklist sharing, with user authentication- Advanced Search Engine supporting fielded boolean queries with wildcards and proximity queries- Support for drilling down into searches using facetting- Visualization of related booksAdvanced FeaturesAdvanced Feature 1: Search engineOur advanced free text search allows searching through the entire corpus of books using a complex and powerful query language which support boolean queries, wildcards, and proximity queries. This feature allows you to discover new books which might be of some interest. The search algorithm is based on term frequency-inverse document frequency. This algorithm is widely used as a base for search engines like google. The basic idea is that you have a set of documents, each of which has a list of terms. For each document, you count how many times each term appears. Then you divide that by how many documents the term appears in. This ensures that terms which are unique to a specific document, and appear numerous times in that document, contribute significantly more to a search score than terms which appear in every document a lot of times (An example of the first type of term might be something like 'Alice' in Alice in Wonderland, and the second would be the word 'the'). We also use lists of stopwords so that words that we know are not unique (i.e. 'the') don't adversely effect searching.Our advanced search also allows us to calculate facet values for specific fields. We currently support facetting on author, language, subject, and if the book is public domain or copywrited. This allows you to drill down and refine your search as your looking through the results. This is a quick way to amend your search and add criteria such as 'I only want results that are in english', or 'I only want to see books by Lewis Carroll'.Advanced Function 2: VisualizationOnline stores often provide lists of related books. We want to do something similar but unique -- put related books in a non-linear data structure, a graph.Problems with graph layouts include edge crossings (famous Kuratowski theorem characterizing crossings, it turns out most graphs have crossings), which we want to minimize. We also want to distribute vertices evenly and conform to the frame. We also want connected books to be near each other.Our solution is to use the algorithm from a seminal paper with 4000 citation, Fruchterman and Reingold. The goal: distribute vertices evenly, minimize edge crossings, reflect inherent symmetry. The method: analogy to natural forces, nodes move relative to each other until energy minimized at equilibrium state -- nodes too close together will repel, connected but distant nodes will attract. This is a heuristic for aesthetically pleasing layout; it only converges to a local, not always global, minimum. The model is defined as follows. Let - A be the area of the canvas - graph G with - n_i and n_j be an arbitrary pair of nodes in the graph - p_i and p_j be 2d coordinates of nodes n_i and n_j - N be the number of nodes - C be an adjustable constant - k=C\\sqrt{A/N} - F_a(n_i,n_j) = ((|p_j-p_i|^2)/k)*(p_i-p_j) is an attractive force between each pair of connected nodes - F_r(n_i,n_j) = (-k^2/|p_j-p_i|)*(p_i-p_j) is a repulsive force between all pairs of nodes.Our implementation of this algorithm uses the D3.js visualization library. The visualization started with a simple graph with draggable nodes. We added panning and zooming, a book cover at each node, and hyperlinks to navigate to the next book. We implemented the algorithm described above for node layout. The forces were slightly modified to prevent book covers from overlapping. The algorithm uses D3's time-stepping, which causes some instability at the beginning of simulation, but seems to stabilize.Also, we wrote an algorithm that takes a book id, and returns related books along with their inter-relationships among themselves. This algorithm accumulates statistics including whether authors match, how many tags match, and the text search results. These statistics are put into a histogram which is truncated to choose only the strongest connected nodes, which receive a graph edge between them. Currently, the database of books is small, so the number of matches is small, so there is no need to truncate the histogram.\n", "members": ["Jonathan Mares", "Anthony Lu", "Lloyd Ramey", "Paul Dworzanski"], "skills": []}, {"name": "Longan", "desc": "\nDescriptionLongan is an application that curates career fair information from multiple universities. This application aims to allow high school students to make informed decisions and assist university students attending career fairs.  UsefulnessThere are no similar web sites/applications that we know of.RealnessCareer fair, university, and company information will be retrieved using a web crawler.Description of FunctionalityBasic FunctionalityAllow user to filter results by major, university, and/or companyDistinguish among industries (e.g., tech vs. finance) using color tagsCompare career fairs over time (i.e., by year, fall vs. spring semesters)Advanced FunctionalitySuggest related companies given a user's top choices using data mining techniquesRepresent the (number of) universities recruited by a certain company on a map\n", "members": ["Gabrielle Chen", "gchen46", "Hong Ngai Ip", "Jing Rong Lim", "jrlim3", "Seok Hyun Song"], "skills": ["python", "java"]}, {"name": "Travelmate", "desc": "\nDescription We want to make traveling easier, and allow travelers to have more fun with more companions. To do this, our web application mainly helps users make reservation on hotels and can help travelers who have already reserved a specific hotel to connect with potential friends who wish to travel together.Usefulness  Our hotel reservation function is similar to Expedia: users can search and filter results at their choice, make reservation by only one mouse click, and receive recommendations based on their previous reservations. But what is unique about our project is its social function: many people are traveling alone and want to have someone to travel together, but they do not know people around them in a hotel. After they make a reservation on a specific hotel, they can find other people also go to that location at that time (if those people also want to have someone to travel with) based on reservation those people made, and they can contact with each other.RealnessUser data: name, gender, age, email, this can be obtained when user register the account, and search history is trackedHotel data: name, price, location, photos and ranking information, this can be obtained by manually inputting data from websitesComment data: comment on user (whenever the user publish their information, other people can leave comments on them) and comment on hotel  Functionalities  Basic functions: 1.     Sign up/ Sign in (use third party entry)2.     User profile editing 3.     Search hotel by name or recommend a list of hotel which satisfy the search criteria offered by users and print out results4.     Make reservation5.     Find other travelers also traveling to that place6.     Chat with other users after adding them as Friends7.     Leave comments and ranks for hotels 8.     Delete user Advanced functions:1.     Provide users with more filters to modify the search result, such as price, location preference, and brand 2.     Enable to users to upgrade to prime member by paying a price, prime members can receive discounts and rewards occasionally3.     Recommend other hotel similar to the previous ones whenever user want to make reservation again4.     Interesting API(may not count)5.     Enable online payment using virtual currency6.     By destination, offer some recommendations of food, tourist spot and travel strategy to user (skd and yuki)\n", "members": ["Lingzhi Chu (lchu3)", "Yuxuan Chen\\xa0(ychen419)", "Kedong Shao (kshao5)", "Shuijing Liu (sliu105)"], "skills": ["python", "java"]}, {"name": "Shoetopia", "desc": "\nThe e-shopping experience has become flooded with garbage entries that make it quite a challenge to find the hottest sneakers. We have meticulously constructed the greatest shoe catalog that will let you find the perfect sneaker for you. Our team scours the web for the best shoe websites which we then compile into a massive database from which we get your own personalized shoe of the day which is what sets us apart from all the competition. The basic functions of ShoeTopia include a database that can update information about each individual user, each individual shoe, and also a set of hand-picked websites which contain only the greatest shoes. The advanced functions of the website include an expert analysis of your history to select an amazing shoe of the day just for you. Another amazing feature we have looks at the aggregate history of all our users and finds the most popular shoe and gives you the shoe of the month. Overall, ShoeTopia is revolutionizing the shoe shopping industry and we have a 100% guarantee that you will get nothing but the most amazing sneakers on the market.\n", "members": ["Sahana Jain sjain46", "Vimal Patel vnpatel3", "Kharun Samuel ksamuel2", "Ronjoy Kalita", "kalita2"], "skills": ["python", "java", "php"]}, {"name": "Illini Fantasy", "desc": "\nDescriptionThe goal of the project is to produce a fantasy sports website for University of Illinois sports.  This fantasy sports game will support the bulk of the NCAA sports played by athletes at the University of Illinois.  Participants will compete by selecting fantasy athletes from the various supported sports.  This fantasy game is cross-sport, so that basketball players and softball players (for instance) can all be part of the same team.UsefulnessThis application has two synergistic purposes.  The most obvious purpose is that it is a game which should be entertaining to participants.  Fantasy sports have been around for over a decade and is well-established as entertainment.  However, our application is different from every existing fantasy sport application in that participants can assemble fantasy teams using athletes from multiple sports, to compete against each other on the basis of statistical models configured by users (not hard-coded in our application) at the start of each virtual \"tournament\".  The players may come from any Illini sport competing during the time frame of the fantasy tournament. This is a design challenge as the statistics of a softball player need to be normalized in some manner to the statistics of a basketball player.  The second, ancillary purpose of the application is that it will help to promote the lesser-viewed college sports as anyone competing in our fantasy tournaments will have an extra incentive to learn about and follow all Illini sports - not just those gaining attention from ESPN.RealnessThe bulk of our data are statistics from NCAA athletes competing in University of Illinois sports. This data is available through the University of Illinois \"fighting Illini\" website.  For the production of the prototype, we will use statistics from the past as a proxy for real-time data.FunctionalityBasic FunctionsReal Illini sports data will be collected.  This data exists as pdf's on the Illini website.  Pdf is not the best format for crawling so we will consider requesting the data in a more amenable format from the athletic department.User / participant accounts will be created for a sufficient number of users to hold fantasy tournaments.Insert/update/delete will be used for user account information (passwords, etc.) as well as tournament creation.Advanced searches using table joins will be used to determine the winners of individual tournaments.  This will require joining sports statistics across various diverse sports along athletes chosen by the participants.Additional searches will be available to view past performance so participants can make informed decision on assembling their best fantasy team.Advanced FunctionsFunction #1Users will be able to initiate tournaments in which they can dynamically establish their own game rules, for example, dynamic weighting of the relative importance of sport/athlete performance metrics. In this manner, tournament designers can build individual rule sets which emphasize the diversity of Illini athletics as well as require research and skill to win rather than simple luck.Function #2 One complexity of building a fantasy application which spans multiple sports is how to measure \"great\" performance vs. mediocre or poor.  Our second advance functionality will be to design individual sport performance metrics based on their relative deviation from the average.  For instance, if the standard number of rebounds for a basketball player is 2 per game, 4 would add many fantasy points while 1 would provide few if any.  Similar metrics can be designed for other sports - for instance, the average number of hits during a softball game may be 3.  6 hits would result in a large bolus of fantasy sports while 0 would be few if any.\n", "members": ["Derek (Michael) Ferguson derekf2", "Mike Walsh mwalsh34", "Michael Liacopoulos liacopo2", "Michael Gryk gryk2"], "skills": ["java"]}, {"name": "QueenOfLibra", "desc": "\n Description Can not decide what to eat? Hard to make choice every time? Deciding a place for lunch could sometimes be a super annoying and energy consuming progress. This App saves those who has OCD in making food decision. Unlike common recipe recommendation App, we do not simply providing information to you, we are trying to make choice for you. Based on the feature data of restaurants and user behavior, we utilize Machine Learning algorithm to figure out users' preference model and recommend restaurants which the user are very likely to enjoy. By collecting user's feedback, we can constantly revise the model and make the recommendation more precisely. Usefulness.  Our application is designed to help you make decisions for choosing what to eat. It recommends restaurants for users based on preference Q&A and users' meal history. For example, it will avoid recommending food that a user just had yesterday. If no preference given, the application will randomly pick one based only on history.It will be similar to some other restaurant rating or recommendation applications like Yelp, but not the same because it is not only a list of restaurant information but most importantly, a decision maker of what to eat.Realness.  Our Data is the restaurant information in Champaign, including the name, address, food menu, food style and rate and so on. The data could be collected by searching form the existing food recommendation app such as Yelp. In addition, the data could also be created by users themselves. Description of the functionality that you plan to offer. This is where you talk about how to meet the advanced functionality requirements.  There are two types of functions you need to offer Basic Functions: 1. showing data of the restaurants and their menu2. adding new data entry, deleting data entry, update data entry 3. query and return the corresponding resultsAdvanced Functions:1. recommend restaurants based on preference Q&A answers and features of each restaurant. 2. adjust the users' preference model with Machine Learning algorithms based on users' history. These advanced functions are cool because they will provide more personal recommendations to each user. We are applying Machine Learning algorithms to avoid recommending the same restaurant the user had yesterday. Theses functions also allow us to match restaurants with users' preferences better. \n", "members": ["Yang Liu", "Rui Xia", "Bo Zheng", "Anqi Mao"], "skills": ["python", "java"]}, {"name": "Project Summary / Slogan", "desc": "\n\"Yelp\" for flighta. Description Up in the Air is a website that records and provides statistical analysis of the history of the users’ flights, airlines and airports. There would be a personalized travel map, which marks the added flights. It is available for the users to add relative photos and comments to flights, airports and airlines. And they can also find friends with same or similar schedules, chat with their friends online and check the details of their flights if they are allowed.b. UsefulnessUp in the Air can be an effective way for the travelers to keep track of their flights of where you've been and how you got there. It is also a social platform, where the users can contact with friends in the same flight. One similar web application with ours is called “Flightdiary”. Both two websites record and analyze flight information of the users. But in Up in the Air, we provide the functionality for comment and upload picture for including each airlines, airports and flights for people.  we also provide searching for friends on same or similar flights, which is not available on Flightdiary, while ours can search for friends based on their sharable flight information like dates and airlines. Online chatting is available between friends. c. RealnessThe data our web will deal with will be divided into six entity sets: User, Comment, Flight Record, Aircraft, Airline and Airport. The User relation will contain attributes id, name, account and password. These data will be gotten directly from input of users. The entity set Flight Record will include attributes like ID, flight number, date, depart time, arrival time, class, seat, and purpose. These data will comes from user when they add a flight to their account. However, our website will also automatically search for source airport and destination airport information for them. The comment will be a weak entity set supported by User sets. The comment will contains attributes like timestamp, content, URL of photos. These data will also be gotten directly from input of users. The data such as Airport, Airline and Aircraft will be directly crawl from online free database (Openflight.org). For airport, it will contains attributes like ID, name, city, country, ICAO, IATA. For aircraft, it will contains attributes like ID, model, manufacturer. For airline, it will contains attributes like: ID, name, country, ICAO, IATA. All of the data we are talking about is easy to retrieve and meaningful in our design.d. FunctionalityBasic Functions:An account system where the user can login with their email address and password. In the account the users are able to add new flights their flight record, add comments and add friends for chatting. Users are able to look through the history of his flights and informations and even query from the website to see statistics and graph of their trip records. The searching system of information of a specific airline, airport or flight to read comments and see pictures of airports from other users to have a better knowledge about their trip in advance.Advanced Functions:Social Mail: The website will allow user to search for people to share the same trip and chat with them in advance, so people may have friends during the boring flight.Data Visualization: Visualize user generated flight record with pie/bar/line charts and google maps for routes. This way, our user can better understand and analysis their behavior of air life.\n", "members": ["Wanli Wang", "Haoyu Wang", "Tianhao Chi", "Zhuo Li"], "skills": ["php"]}, {"name": "CU Events", "desc": "\nDescription:A site for finding events in the Champaign-Urbana area based on different categories such as music, sports, theater, and technology as well as different event types such as concerts, presentations, and workshops.Users will be able to create accounts where they'll be able to set their interests, receive recommendations, post comments on a specific event, and post their own events and create communities for a specific interest or activity.The goal of this site is to allow users to find events that align with their interests as well as to try to expand their interests by exposing them to events that they may not have been able to hear about otherwise.Usefulness:Similar sites exist such as Eventbrite and Ticketmaster, however, our site aims to be different through postings of events with specific interests and smaller organizers such as RSOs. We will also allow users to create their own communities that will help members communicate with each other and stay up to date on a particular club or activity.Realness:Data on the site will be in the form of user messages and event details such as name, start and end date, location, price, and description. Our data will come from crawling sites as well as from users themselves. Sites used for crawling will include Eventbrite, Ticketmaster as well as smaller sites specific to Champaign-Urbana such as the sites for different RSOs.Functionality:Basic:searching events by category, event type, start/end times, price, etc.creating and modifying user accounts with your own interestsposting your own eventscreating and searching for communitiescommunicating with other users through messages on events and communitieslinking from events to other sites where you can buy tickets for the eventAdvanced:recommendations for users based on their interests and what events they've recently viewedautomatically match up stock photos to each event based on event details\n", "members": ["zzaman3", "mswisz2", "rchang13", "jmakdah2"], "skills": ["python", "flask"]}, {"name": "WeDate Pro", "desc": "\nDescription:We will design a dating website that helps people to find the person that want to match. There are two kind of searching, the first one is to search by key words (like gender, age, nationality, hobby or appearance) the second on is to search by selecting several pictures of “fake” people so that the system will automatedly recommend some person for you to match.Usefulness:There is a similar app called Tinder that is an app designed for dating service. However, in Tinder we could not set the preference and only wee the people we want.          This project will help people to find idea dating match by two kind of search. The first one is based on word description and the second one is based on pictures. Therefore, people can find the people they want to date either by personalities/hobbies or appearance.Realness:           There will be 10 to 20 true accounts created by group member and their friends.           There will be around 100 fake accounts generated randomly          Basic functionality:\u009f   Create account\u009f   Update account\u009f   Delate account\u009f   Search account\u009f   Display account profilesAdvanced functionality:PrototypeSet the preference of one account at the time you create the account. Able to edit later.People's information is stored in the questionnaire (mainly appearances, etc.). Moreover, they can also set preferences for the people they would like to know. Based on this information, the system will generate six recommend pictures that you can look for detail, or you can select two pictures and the system will generate another six picture based on your selectionMatch and leave a messageYou can search for the attributes you select and match with other people, when you click \"match\", the information is sent to the people you want to match and you can also leave a message to her/him to further introduce yourself. The message can be updated later\n", "members": ["Jiayou Sun jsun58", "Jing Zhou jzhou63", "Hao Xi haoxi2", "Charles Swarts swarts2"], "skills": ["java", "php"]}, {"name": "Housing Bubble", "desc": "\nFunctional Description:        This project aims to help people who want to search for housing renting information. The project will feature a database based on housing information. Because of the presence of many areas or regions like Urbana-Champaign which is populated with out-of-state/alien residents like international students, faculties and many other diverse groups of people, the market for renting information is in great demand. Therefore, we decide to build a platform that targets this group of people.        The platform will require users to sign up for an account and be logged in to look at renting information. The sign-up process, as you can imagine, asks for a username, a password, and other optional information like their age or major to contribute to the recommendation system used later. Users will have their own profiles based on their sign-up information. The information includes but is not limited to their phone numbers, email addresses and so on. They will be able to edit their profile if they wish later.         Housing/renting information will contain attributes including but is not limited to location, price, size and housing conditions. Users can browse the housing information with their specified requirements on attributes like location, rent, size and facilities.         Users can add houses to their favorite lists, which is maintained in the database. Users will be able to set, modify or delete their favorite list.  Also the browse history of the users will be automatically saved and can be modified or deleted by the users. The browse history combined with the favorite list will be used for the back-end to dynamically produce recommendations to the users.         One of the advanced techniques of this project is the recommendation system. As mentioned, the database keeps a track of the users' favorite list and browse history. Using machine learning techniques and other advanced algorithms like nearest neighbor clustering algorithm, the system will be able to generate (ideally) high quality recommendations to users. The users can give either a positive or negative feedback to help improve results.        The other advanced techniques is smart search. We will allow users to make queries like \"houses within 10-min (distance) walking (means of transportation) distance from Grainger(center location)\" and \"houses with four bedrooms, at least two bathroom, and dryer and washer\". The system will return the best fitting results based on users' request. \n", "members": ["Qingtao Hu (qhu13)", "Yunzhe Pan (ypan19)", "Yinchen Xu (yxu72)", "Qixin Zhu (qzhu3)"], "skills": ["python", "java", "php"]}, {"name": "FitFeed", "desc": "\nTeam 9project title: FitFeedproject summary:   A webpage platform that give users recommendations of healthy food and allows users to search for food based on categories and calories as well as order and receive orders from other users.  DescriptionIn US colleges, it is really hard to eat healthy: there are limited choices of restaurants, and a lot of restaurants are expensive and not healthy. Dining hall does provide healthy choices of food but is overpriced and only offer meal of limited time: 12 dollars for lunch and 15 dollars for dinner. Often, college students do not have time to have healthy meals every time. Too often, college students don’t have time to calculate the calories for each meal combining the results with the suggestions of how many calories they should intake per day.Our project recommends healthy food choices based on calories and nutrition facts. It also serves as a buy/sell platform of homemade healthy food at lower prices(no intermediate costs), in which users can search for food, order food, sell food and receive recommendation of the intake calories per day as well as fitness facts at one place. Usefulness  Our application is somewhat similar to regular take-out restaurant website and app, such as Grubhub and Orderup that focu on online food ordering. Moreover, our application will recommend food and restaurants based on the calories the users need to intake per day, and get fitness facts and suggestions of healthy diet and eating.Users would like to know more about healthy diet and eating. To help them achieve this goal, this webpage will  give customers the information of how many calories it contains in the food of their choices, the application will also calculate the suggested amount of calories intake based on the users’ personal information when they create their accounts. We will build a chat platform, so customers can chat with sellers or other users to order food. This is a very useful functions especially when customers don’t know what to choose and have specific requirements of the food they choose.  Realness  Data types:User’s basic information related to fitnessNutrition fact of food/dishesHealth advice and fitness recommendationsRestaurant informationData resources:Yelp/Google reviewNutrition fact database(myfitnesspal.com, etc)GrubhubFunctionalityBasic Functions:Log in / outUser information storageFood search based on taste, calories, nutrition, price and othersCalculation of recommendation of Calories intake per dayPlatform for buying and selling food Advanced Functions:Real-time chat with other users/restaurantsFood / restaurant recommendations\n", "members": ["Pei Liu(peiliu3)", "Yuting Yang(yang217)", "Chujie Qin(cq2)", "Xu Li(xl2)"], "skills": ["python", "java", "php"]}, {"name": "Go Together", "desc": "\nDescriptionPeople often meet a problem: I want to check out a new restaurant or watch a movie or going somewhere, but no one goes with me. This is a common problem among a lot of people. So we are planning to design a website to help people find mates to do something together. We call the website GoTogether. On GoTogether, people can view other people’s proposed event, propose event and look for mates or find/provide a free ride.UsefulnessThere is no unified platform to look for mates and people are in need of such platform. Facebook Group is currently a similar platform. Facebook group is created and maintained by individual. There may exist multiple groups for just movie watching. Users may miss an event if they are not in the group. They may also have a hard time on deciding which group to join in and they may found themselves lost in massive and unorganized posts.  On GoTogether, you don’t need to join a group to propose an event or check what others proposed. You will not miss a post and posts are organized by category(movie, restaurant, etc). RealnessWe will create user profiles and posts manually.  User profile will contain user’s username, email address. For free ride post data, it will contain post id, user id, event start date, event end date, seats number, destination and current location. For other post data(movie, restaurant, etc), it will contain post id, user id, event start date, event end date, category and location. All Posts data will also contain comment message. NotificationDescription of the functionality:Basic Functions:User login/logout/registration/update profile.Users can make a post or delete a post on events they are interested in. For example, they can invite people to have dinner or watch movie together; they are allowed to offer a lift or request for free-riding. Posts are categorized and user can filter post based on its preference or search for specific contents included in posts. User can reply to a post or start an asynchronous conversation with people who have common interests.User gets notification when people are interested in his/her event or their individual demands can be potentially satisfied by particular posts.Advanced Functions:(1)Geographical Clustering and Path OptimizationFor students who offer a lift (named as provider) and who request free-riding (named as requester), their location should be considered. We store current location of both providers and requesters in database and keep a record of their destination. If some requesters have the same destination as well as similar time, we should perform geographical clustering based on their location to form different groups. The groups are then assigned to a couple of nearby providers depending on their locations. In this sense, each provider is in charge of several requesters in his/her neighborhood without driving far away to pick up other requesters. After the group and corresponding provider are determined, a recommended path should be generated for providers to pick up each requester in his group. The path is computed based on a weighted graph derived from local maps and should be optimized to reduce the total cost of routing. Tentatively, the clustering can be implemented by K-means algorithm and the path optimization can leverage approaches designed for Dijkstra and Travel Salesman Problem.(2)Related Events RecommendationWe will use data mining technique and based on user’s viewing, searching and posting history to recommend event or other user. For example, using TFIDF to compare post similarity. More data mining technique will be added as we go deep into the project. \n", "members": ["Yisi Liuyisil2", "Wutong Gaowutongg2", "Yingyi Zhangyingyiz2", "Yi Yangyiy4"], "skills": ["java", "php"]}, {"name": "Rate My Classroom", "desc": "\nDescriptionRate My Classroom is an idea similar to that of Rate My Professor, except instead of rating the quality of people or classes, it rates the quality of the classrooms.The site would allow users to give an overall rating to the classrooms and lecture halls they have attended class in, write descriptions of their experiences there, and add tags for specific aspects of the rooms. Such examples of tags would be:  no leg room, no lefty desks, lots of broken desks, air conditioning (yes or no).Users would be able to utilize reviews left by others to help search their potential classrooms and see whether or not they want to consider switching sections to a different classroom.  Along with searching information about individual classrooms, users could search for certain features (tags) and get a list of all the classrooms that have those specified features.  For example, a user looking for classrooms with air conditioning, leg room, comfy chairs might get a list that includes such rooms as DCL 1320, ECEB 1002, and Siebel 1404.  Another feature includes the ability to see if two classrooms are able to be traveled between in the standard 10 minute passing period.  This would include traveling by foot, bike, and public transportation.UsefulnessTo get the information on what buildings/classrooms are used for classes, as well as what classes are taught in each building, the UIUC Course Explorer API would be used – the results of these searches would be stored in a database.The actual ratings and tags for each classroom would be user generated.The information about the travel time between buildings would be derived from the Google Maps API.The travel time between each building on campus is stored in a database.Walking and bike times are storedBus time is a live-lookup due to time-of-day sensitivityDescription of FunctionalityBasic FunctionalityStoring ReviewsViewing ReviewsApplying filters to search data by tagsAdding tags to classroomsCreating user accountLogin as userLogout of userAdvanced FunctionalityAllowing users to find buildings with the features they desire that are within walking or biking range of a specific buildingThe information about the travel time between buildings would be derived from the Google Maps API (with the travel time between each building on campus stored into a database).    \n", "members": ["Andrew Bloomberg", "bloombe2", "Kartikey Desai", "kdesai30", "Mrudula Vysyaraju", "vysyara2", "Aditya Duri", "duri2"], "skills": ["python", "flask", "java"]}, {"name": "Foodlicious", "desc": "\nDescriptionFoodlicious is an idea for users to share recipes and give feedback to/from other users, similar to stackoverflow.This site allows user to create their own account and set up an user profile. Users can upload their own recipes and see other's recipes.Users can review others' recipes including a rate, tags and comments and  receive feedback for their own recipes in the same way.Every recipe will be given a rate by each review and a ranking system will be established for recipe ranking based on its overall rating, tags and comments.Each users's data as average ratings to other recipes, average rating of his own recipes will be recorded and shown in the profile page.Users can search recipes by various criteria.UsefulnessRecipe sharing is a very popular idea these days. We'd like to create a website where users can upload, get feedback on their self-published recipes from other users, search recipes, and also be recommended with recipes. The advantage of our website compared to other recipe blogs is that we combine multiple functions together. For users, you can both upload and search for recipes. You can also rate recipes and a ranking system of recipes will be established so that you will automatically recommended with recipes that you may like. RealnessOur data will mainly consist of recipes. In addition, we will play with users'profile, search history and the reviews of recipes including comments, tags, ratings, and consequent evaluation attribute such as ranking.Our recipes can be uploaded by the users. But most of our recipes will be obtained from the web. Reviews can be generated by users or retrieved from websites. FeaturesBasic Functions: -Creating and modifying User Accounts(Registration & Log in)-Uploading and Deleting files-Viewing, Comments and Feedback on  recipes-Rating and adding tags to recipes-Searching with multiple criteriaAdvanced Function:-Ranking recipes based on their ratings, tags and comments-Recommend recipes based on similarity between users and recommend high-rating, low-calorie recipes:We intend to build a recommender system using user based collaborative filtering method. The basic idea  is to find the user who is most similar to the current user, and use the ratings from this most similar user to make recommendations. Also, we need to consider the actual usefulness of the recommendation so that we return those results with highest ratings/rankings and lowest calories. \n", "members": ["Dehua Chen", "Lingsong Gao", "Patrick Wang"], "skills": ["java", "php"]}, {"name": "Accipere", "desc": "\nDescription:We will be developing Accipere (pronounced “ah-chi-PE-ray”), a mobile-friendly Web application for managing receipts digitally and providing users with data on how they spend their money. Usefulness:The application will be useful because it will let you view all your spending in one place, without having to log in to all your bank accounts and then having to write down or calculate all your spending over multiple websites. It will also let you see what items you spent your money on, without forcing you to keep physical copies of the receipt.There are a few different websites with mobile apps available, including https://www.concur.com/, https://www.shoeboxed.com/, and https://www.certify.com/, among others. Our application will be different from theirs because it will be more geared towards individual users, and it will allow you to choose which form of payment you used to pay for the receipt, including be able to choose which account you used to pay for it (credit card 1, credit card 2, debit card 1, checking account 4, etc)Realness:Data Collection: We’ll have real users taking pictures of receipts with their phones and interacting with the central server via a Web interface.  Most people have to deal with receipts on a daily basis, so plenty of data will be available.Basic Functions:Insert/Update/DeleteWe will insert records into the database when creating a new account, creating a new receipt, and starting a new login session.We will update records by allowing users to change information related to their account and allowing supporting data for receipts to be modified.We will delete records in the database by allowing our users to remove purchases from their history of past purchases.Advanced Functions:One of the advanced features we would like to include is optical character recognition (OCR). This would allow data such as the purchase total to be automatically read from a receipt rather than being manually entered by the user. We think this would be a cool feature, as it would allow users to more quickly store their purchase information in our application, and would just be a great quality-of-life feature.The second advanced feature we would like to implement is heat mapping of users spending habits. This would create a graphical representation of where the user(s) is making purchases based on how many purchases have been recorded within a certain geographical area. We thought this would be a cool feature because it would allow the user to graphically see where they are spending their money, but it could also be of use to businesses, who could potentially use a heat map of all of our users purchase data to determine which areas are hot spots to open stores at.\n", "members": ["Lukasz Borowczak", "Christopher Lewis", "Richard Weeks", "David Wales"], "skills": ["java"]}, {"name": "Engineering Master School Finder", "desc": "\nDescriptionOur goal is to help people who want to pursue an engineering master's degree to find the most appropriate academic programs, according to their desired school ranking, location, applicant’s GPA, GRE and other indicators. Also, based on the essential function of our website, we build a sharing platform that users can share their comments on a specific program and an admission prediction function that using users’ application results to get the admission probability of programs.UsefulnessWhen people want to apply for graduate school, the general procedures waste much precious time. People need to look through dozens of the official website of universities, filter their desiring schools manually during to schools’ ranking or location and so on, then compare the program’s requirements related to their major and their real truth. These manual procedures can be optimized by computer technology.There already are some helpful websites such as US News that can enumerate the top ranking of universities and programs. However, US News cannot restrict the specific condition such as GPA and GRE, and it cannot combine the requirements from clients and find the most appropriate programs for clients. Also, clients of US News cannot share their comments on a specific program which could be very helpful for other applicants.Our website fixes all the problems mentioned above. We will combine the requirements from students and consider students’ basic information, then find and recommend them the most appropriate programs. Also, the comment function and admission prediction function are very helpful for the clients in our website to assess their desiring programs comprehensively.RealnessThe school ranking and program ranking will be collected from US News. The data related to specific school and program such as school’s location, Tel., minimum GPA and so on will be collected from their official websites.Description of the functionalityI.         Basic Functions:Considering the data’s reality and usefulness, we decide to scratch some real-time data from USNews.com, www.harvard.edu, www.uiuc.edu, etc. more than 100 websites, to crawl raw data like contact info, campus location, postal code and so forth.Use mySQL language to insert/update/delete records to the database.Use mySQL language to show tables joint, filter, and so on search operations.Add comments of users into database, like creating a table, comment (userid, programid, commentNo, date, content, grades and marks,)II.         Advanced Functions:1. Visualize university info on dynamic U.S. map.1)    Prepare the map canvas used for hitting universities on2)    According to user’s request, end-front will calculate and fetch the satisfying results from database, and get and project the address information onto map canvas.  3)    Program front-end application, to pop up bubbles, which stands for an university located on that place on map, once the request enquiry has got correct returned data; and once user wants to move mouse onto one bubble, there would be a little widget putting up and shows the university information like address, rank, websites, application requirement info and so forth.4)    Move mouse to other bubble, and repeat step (c).5)    Click on bubble, a super link will occur and bring user to specific university page.2.  Recommendation System1)    Users input their one or two target school2)    Do pattern mining based on all users applications according to users' target school2)    Generate a list of schools and list them on website 3.  Real-time Data Capture1)    Implement web crawler to collect programs information from college rank websites and related programs official websites.2)    When users search for programs information, web crawler captures data from related websites automatically to make sure programs information are up-to-date\n", "members": ["Hao Wang (haow4)", "Wang Xi (wangxi2)", "Zixian Song (zsong11)", "Xu Yang (xuy2)"], "skills": ["java", "php"]}, {"name": "Bear the Bull: Stock Market Analytics", "desc": "\nDESCRIPTIONThe Bear The Bull site will provide research and analysis capabilities for investors as well as the ability to buy and sell stocks.  Users will be able to analyze stocks of their choice by reviewing trends, history, volatility, and most importantly customized suggestions.  We will maintain the user’s transaction history so that we can suggest relevant investments tailored to their preferences.  This will include stock prices the user is comfortable purchasing as well as favored sectors (such as technology or health care).Our site will provide a portfolio building experience unlike any current financial help site available.  It will save investors considerable amounts of time by quickly and efficiently providing relevant data from the stock market and past transactions. We plan to put the power in the user’s hands by giving them an interactive site that helps them build their stock portfolio and continuously enhance it as additional information is gathered.USEFULNESSSimilar to what Yahoo (or RobinHood.com) has, but we are much more customizable.We provide services including making customized query/analysis to users, crawling other social media for most updated news, and making stock transactions via the website. It’s useful in the way that unlike Yahoo and RobinHood provide status quo analysis, the user can make their own analysis or judgement based on their customized query or dig into high volume social media information. With more advanced information, the user can beat the other competitor and gain profit.REALNESSThe data used for this project is all real data. A Python crawler is used to obtain data from various sources, including Yahoo Finance and Open Knowledge Foundation. We use all 500 constituents companies of S&P 500 index as our data sample. S&P 500 index is one the most popular broad stock market index used in the financial market.Three types of data are collected:Company profile data. It provides a summary of each company; the attributes include “enterprise value”, “total number of shares outstanding”, “sector”, “address”, “business summary”, etc. Stock summary data. It provides a most recent snapshot of each company’s stock information; the attributes include price/earning ratio, beta exposure to the entire stock market, average trading volume, dividend yield, previous 52-week high and low, etc.Stock price history: the daily price history spanning from 2000/1/1 to 2016/12/31 for all 500 stocks are scraped from Yahoo finance. In total, over 1 million records are stored and used for the price history data. Each data record includes information such as ticker, open price, intraday high and low, closing price and total trading volume. FUNCTIONALITYBASIC FUNCTIONSAs suggested above, we shall be using static data from Yahoo for working with our application and our database will contain relations for stocks, stock prices, users and user transactions. We will be able to add/update/delete stock records in the database as well for maintenance purposes (?). This way the users can query relations for specific company stocks, stocks with highest price, observe the daily highs and lows etc. These kinds of queries can be performed using join operations on two or more relations. Once users log into the website and buy/sell the stocks they want, the transaction would be added to the database along with their details. This information will be used for historical tracking purposes of stocks.ADVANCED FUNCTIONS:Stock recommendations based on Price and SectorUsefulness: Our application will be capturing the stock information in database along with their price as well as sectors (eg. tech). When users purchase/sell the stocks these transactions will be captured in our tables as well. So when they sign in to make their next transaction, they would be able to see possible stock suggestions based on their own personal history of past transactions. Additionally, these suggestions would be further filtered by sectors/prices etc so the user can browse all categories with ease. This will add a personal touch for each user with respect to what stocks they see, making our application more useful and intuitive for them. Challenge: This would be a bit challenging for us to implement in technical terms since we will have to add constant monitoring capabilities for individual user transactions. Also this information will have to be stored and maintained for them in a way that it does not mix with other users’ transactions so as to make the suggestions personal. This would involve having a customized polling approach that looks out for specific transactions on tables and verify the suggestions via thorough testing.   Novelty: This feature would be different from other similar applications because usually they indicate the current in-demand stocks based on live stock exchange status rather than user’s choices. This would separate our application from others by making it more customizable and handy from the user’s perspective. 2. Display “hot” stocks based on history of user transactionsUsefulness: This feature imparts a clean perspective to users as well by helping them see what the other users have been buying lately. By observing which stocks sell the most, the novice users can get a clear idea about what is the current status of the stock market without being overwhelmed by all the exhaustive information available on the web. Experienced users might be comfortable doing this, but when the novice users are starting within the stock-market world, it could be scary for them to absorb all of the market stock patterns at once. Here our feature will prove instrumental in guiding them practically by displaying only the important information in a brief manner, such as the most frequently bought stocks by users. This will start them off to say the least and start gaining a footing, after which they can browse and explore more options as required. Challenge: This will prove to be challenging for us because we will have to monitor the user’s personal transaction history as well as that of the whole user domain in order to display personal as well as general stock recommendations. That hard part would be to separate both features and have individual pollers/analysers for the existing stock trends. That way, we can determine the user-based personal stock recommendations as well as the maximum number of stocks bought by all users for generic recommendations. Also these analysers will have to be fully tested to make sure their behavior is FAD and also that these recommendations change over time based on dynamic user transaction data.Novelty: Again, this approach is different than what the similar applications use because they display everything related to stock trends on their websites. By displaying a sub-set of information based on current user transactions, we impart our application the ability to represent the same stock patterns in a more understable and lucid manner. This guarantees a more user-friendly, time-saving and pleasant UI browsing experience for users which increases the user satisfaction.3. Portfolio Volatility calculatorUsefulness: This will provide a real time risk measure of the user’s portfolio and enables the users to understand the risk of their portfolios and help them make better investment decisions. Challenge: The portfolio volatility calculator will depend on both stock information and the portfolio information in each user’s account. Ideally it would also pre-calculate volatility impact for any stock the user intends to buy or sell.Novelty: The feature is not currently observed in the major finance or stock broker websites. \n", "members": ["Jian Du", "Matt Hubbs", "Khushbu Vaishnav"], "skills": ["python", "java", "php"]}]